nevinxu/HM502B2/platform/CMSIS/Include/device/MKL33Z4/MKL33Z4_lcd.h
/*! @brief Read current value of the LCD_GCR_FDCIEN field. */
#define BR_LCD_GCR_FDCIEN(x) (BME_UBFX32(HW_LCD_GCR_ADDR(x), BP_LCD_GCR_FDCIEN, BS_LCD_GCR_FDCIEN))

/*! @brief Format value for bitfield LCD_GCR_FDCIEN. */
#define BF_LCD_GCR_FDCIEN(v) ((uint32_t)((uint32_t)(v) << BP_LCD_GCR_FDCIEN) & BM_LCD_GCR_FDCIEN)

/*! @brief Set the FDCIEN field to a new value. */
#define BW_LCD_GCR_FDCIEN(x, v) (BME_BFI32(HW_LCD_GCR_ADDR(x), ((uint32_t)(v) << BP_LCD_GCR_FDCIEN), BP_LCD_GCR_FDCIEN, 1))
/*@}*/

/*!
 * @name Register LCD_GCR, field PADSAFE[15] (RW)
 *
 * Force safe state on LCD pad controls (all LCD frontplane and backplane
 * functions disabled) regardless of other LCD control bits.
 *
 * Values:
 * - 0 - LCD frontplane and backplane functions enabled according to other LCD
 *     control bits
 * - 1 - LCD frontplane and backplane functions disabled
 */
/*@{*/
#define BP_LCD_GCR_PADSAFE   (15U)         /*!< Bit position for LCD_GCR_PADSAFE. */
#define BM_LCD_GCR_PADSAFE   (0x00008000U) /*!< Bit mask for LCD_GCR_PADSAFE. */
#define BS_LCD_GCR_PADSAFE   (1U)          /*!< Bit field size in bits for LCD_GCR_PADSAFE. */

/*! @brief Read current value of the LCD_GCR_PADSAFE field. */
#define BR_LCD_GCR_PADSAFE(x) (BME_UBFX32(HW_LCD_GCR_ADDR(x), BP_LCD_GCR_PADSAFE, BS_LCD_GCR_PADSAFE))

/*! @brief Format value for bitfield LCD_GCR_PADSAFE. */
#define BF_LCD_GCR_PADSAFE(v) ((uint32_t)((uint32_t)(v) << BP_LCD_GCR_PADSAFE) & BM_LCD_GCR_PADSAFE)

/*! @brief Set the PADSAFE field to a new value. */
#define BW_LCD_GCR_PADSAFE(x, v) (BME_BFI32(HW_LCD_GCR_ADDR(x), ((uint32_t)(v) << BP_LCD_GCR_PADSAFE), BP_LCD_GCR_PADSAFE, 1))
/*@}*/

/*!
 * @name Register LCD_GCR, field VSUPPLY[17] (RW)
 *
 * Configures whether the LCD controller power supply is external or internal.
 * Avoid modifying this field while the LCD controller is enabled, for example, if
 * LCDEN = 1.
 *
 * Values:
 * - 0 - Drive VLL3 internally from VDD
 * - 1 - Drive VLL3 externally from VDD or drive VLL internally from vIREG
 */
/*@{*/
#define BP_LCD_GCR_VSUPPLY   (17U)         /*!< Bit position for LCD_GCR_VSUPPLY. */
#define BM_LCD_GCR_VSUPPLY   (0x00020000U) /*!< Bit mask for LCD_GCR_VSUPPLY. */
#define BS_LCD_GCR_VSUPPLY   (1U)          /*!< Bit field size in bits for LCD_GCR_VSUPPLY. */

/*! @brief Read current value of the LCD_GCR_VSUPPLY field. */
#define BR_LCD_GCR_VSUPPLY(x) (BME_UBFX32(HW_LCD_GCR_ADDR(x), BP_LCD_GCR_VSUPPLY, BS_LCD_GCR_VSUPPLY))

/*! @brief Format value for bitfield LCD_GCR_VSUPPLY. */
#define BF_LCD_GCR_VSUPPLY(v) ((uint32_t)((uint32_t)(v) << BP_LCD_GCR_VSUPPLY) & BM_LCD_GCR_VSUPPLY)

/*! @brief Set the VSUPPLY field to a new value. */
#define BW_LCD_GCR_VSUPPLY(x, v) (BME_BFI32(HW_LCD_GCR_ADDR(x), ((uint32_t)(v) << BP_LCD_GCR_VSUPPLY), BP_LCD_GCR_VSUPPLY, 1))
/*@}*/

/*!
 * @name Register LCD_GCR, field LADJ[21:20] (RW)
 *
 * Configures SLCD to handle different LCD glass capacitance. For CPSEL = 0
 * Adjust the resistor bias network for different LCD glass capacitance. 00 - Low
 * Load (LCD glass capacitance 2000 pF or lower). LCD or GPIO functions can be used
 * on V LL1 , V LL2 , V CAP1 and V CAP2 pins. 01 - Low Load (LCD glass
 * capacitance 2000 pF or lower). LCD or GPIO functions can be used on V LL1 , V LL2 , V
 * CAP1 and V CAP2 pins. 10 - High Load (LCD glass capacitance 8000 pF or lower)
 * LCD or GPIO functions can be used on V CAP1 and V CAP2 pins. . 11 - High Load
 * (LCD glass capacitance 8000 pF or lower). LCD or GPIO functions can be used on V
 * CAP1 and V CAP2 pins. For CPSEL = 1 Adjust the clock source for the charge
 * pump. Higher loads require higher charge pump clock rates. 00 - Fastest clock
 * source for charge pump (LCD glass capacitance 8000 pF or 4000pF or lower if FFR
 * is set ). 01 - Intermediate clock source for charge pump (LCD glass
 * capacitance 4000 pF or 2000pF or lower if FFR is set ). 10 - Intermediate clock source
 * for charge pump (LCD glass capacitance 2000 pF or 1000pF or lower if FFR is set
 * ). 11 - Slowest clock source for charge pump (LCD glass capacitance 1000 pF
 * or 500pF or lower if FFR is set ).
 */
/*@{*/
#define BP_LCD_GCR_LADJ      (20U)         /*!< Bit position for LCD_GCR_LADJ. */
#define BM_LCD_GCR_LADJ      (0x00300000U) /*!< Bit mask for LCD_GCR_LADJ. */
#define BS_LCD_GCR_LADJ      (2U)          /*!< Bit field size in bits for LCD_GCR_LADJ. */

/*! @brief Read current value of the LCD_GCR_LADJ field. */
#define BR_LCD_GCR_LADJ(x)   (BME_UBFX32(HW_LCD_GCR_ADDR(x), BP_LCD_GCR_LADJ, BS_LCD_GCR_LADJ))

/*! @brief Format value for bitfield LCD_GCR_LADJ. */
#define BF_LCD_GCR_LADJ(v)   ((uint32_t)((uint32_t)(v) << BP_LCD_GCR_LADJ) & BM_LCD_GCR_LADJ)

/*! @brief Set the LADJ field to a new value. */
#define BW_LCD_GCR_LADJ(x, v) (BME_BFI32(HW_LCD_GCR_ADDR(x), ((uint32_t)(v) << BP_LCD_GCR_LADJ), BP_LCD_GCR_LADJ, 2))
/*@}*/

/*!
 * @name Register LCD_GCR, field CPSEL[23] (RW)
 *
 * Selects the LCD controller charge pump or a resistor network to supply the
 * LCD voltages V LL1 , V LL2 , and V LL3 .
 *
 * Values:
 * - 0 - LCD charge pump is disabled. Resistor network selected. (The internal
 *     1/3-bias is forced.)
 * - 1 - LCD charge pump is selected. Resistor network disabled. (The internal
 *     1/3-bias is forced.)
 */
/*@{*/
#define BP_LCD_GCR_CPSEL     (23U)         /*!< Bit position for LCD_GCR_CPSEL. */
#define BM_LCD_GCR_CPSEL     (0x00800000U) /*!< Bit mask for LCD_GCR_CPSEL. */
#define BS_LCD_GCR_CPSEL     (1U)          /*!< Bit field size in bits for LCD_GCR_CPSEL. */

/*! @brief Read current value of the LCD_GCR_CPSEL field. */
#define BR_LCD_GCR_CPSEL(x)  (BME_UBFX32(HW_LCD_GCR_ADDR(x), BP_LCD_GCR_CPSEL, BS_LCD_GCR_CPSEL))

/*! @brief Format value for bitfield LCD_GCR_CPSEL. */
#define BF_LCD_GCR_CPSEL(v)  ((uint32_t)((uint32_t)(v) << BP_LCD_GCR_CPSEL) & BM_LCD_GCR_CPSEL)

/*! @brief Set the CPSEL field to a new value. */
#define BW_LCD_GCR_CPSEL(x, v) (BME_BFI32(HW_LCD_GCR_ADDR(x), ((uint32_t)(v) << BP_LCD_GCR_CPSEL), BP_LCD_GCR_CPSEL, 1))
/*@}*/

/*!
 * @name Register LCD_GCR, field RVTRIM[27:24] (RW)
 *
 * This 4-bit trim register is used to adjust the regulated input. Each bit in
 * the register has equal weight. The regulated input is changed by 1.5% for each
 * count.
 */
/*@{*/
#define BP_LCD_GCR_RVTRIM    (24U)         /*!< Bit position for LCD_GCR_RVTRIM. */
#define BM_LCD_GCR_RVTRIM    (0x0F000000U) /*!< Bit mask for LCD_GCR_RVTRIM. */
#define BS_LCD_GCR_RVTRIM    (4U)          /*!< Bit field size in bits for LCD_GCR_RVTRIM. */

/*! @brief Read current value of the LCD_GCR_RVTRIM field. */
#define BR_LCD_GCR_RVTRIM(x) (BME_UBFX32(HW_LCD_GCR_ADDR(x), BP_LCD_GCR_RVTRIM, BS_LCD_GCR_RVTRIM))

