nevinxu/HM502B2/platform/CMSIS/Include/device/MKL33Z4/MKL33Z4_lcd.h
/*! @brief Format value for bitfield LCD_GCR_RVTRIM. */
#define BF_LCD_GCR_RVTRIM(v) ((uint32_t)((uint32_t)(v) << BP_LCD_GCR_RVTRIM) & BM_LCD_GCR_RVTRIM)

/*! @brief Set the RVTRIM field to a new value. */
#define BW_LCD_GCR_RVTRIM(x, v) (BME_BFI32(HW_LCD_GCR_ADDR(x), ((uint32_t)(v) << BP_LCD_GCR_RVTRIM), BP_LCD_GCR_RVTRIM, 4))
/*@}*/

/*!
 * @name Register LCD_GCR, field RVEN[31] (RW)
 *
 * Enables internal voltage regulator. It must have the charge pump enabled.
 *
 * Values:
 * - 0 - Regulated voltage disabled.
 * - 1 - Regulated voltage enabled.
 */
/*@{*/
#define BP_LCD_GCR_RVEN      (31U)         /*!< Bit position for LCD_GCR_RVEN. */
#define BM_LCD_GCR_RVEN      (0x80000000U) /*!< Bit mask for LCD_GCR_RVEN. */
#define BS_LCD_GCR_RVEN      (1U)          /*!< Bit field size in bits for LCD_GCR_RVEN. */

/*! @brief Read current value of the LCD_GCR_RVEN field. */
#define BR_LCD_GCR_RVEN(x)   (BME_UBFX32(HW_LCD_GCR_ADDR(x), BP_LCD_GCR_RVEN, BS_LCD_GCR_RVEN))

/*! @brief Format value for bitfield LCD_GCR_RVEN. */
#define BF_LCD_GCR_RVEN(v)   ((uint32_t)((uint32_t)(v) << BP_LCD_GCR_RVEN) & BM_LCD_GCR_RVEN)

/*! @brief Set the RVEN field to a new value. */
#define BW_LCD_GCR_RVEN(x, v) (BME_BFI32(HW_LCD_GCR_ADDR(x), ((uint32_t)(v) << BP_LCD_GCR_RVEN), BP_LCD_GCR_RVEN, 1))
/*@}*/

/*******************************************************************************
 * HW_LCD_AR - LCD Auxiliary Register
 ******************************************************************************/

/*!
 * @brief HW_LCD_AR - LCD Auxiliary Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * The reset value of this register depends on the reset type: POR - 0x0000_0000
 */
typedef union _hw_lcd_ar
{
    uint32_t U;
    struct _hw_lcd_ar_bitfields
    {
        uint32_t BRATE : 3;            /*!< [2:0] Blink-rate configuration */
        uint32_t BMODE : 1;            /*!< [3] Blink mode */
        uint32_t RESERVED0 : 1;        /*!< [4] Reserved */
        uint32_t BLANK : 1;            /*!< [5] Blank display mode */
        uint32_t ALT : 1;              /*!< [6] Alternate display mode */
        uint32_t BLINK : 1;            /*!< [7] Blink command */
        uint32_t RESERVED1 : 24;       /*!< [31:8] Reserved */
    } B;
} hw_lcd_ar_t;

/*!
 * @name Constants and macros for entire LCD_AR register
 */
/*@{*/
#define HW_LCD_AR_ADDR(x)        ((x) + 0x4U)

#define HW_LCD_AR(x)             (*(__IO hw_lcd_ar_t *) HW_LCD_AR_ADDR(x))
#define HW_LCD_AR_RD(x)          (HW_LCD_AR(x).U)
#define HW_LCD_AR_WR(x, v)       (HW_LCD_AR(x).U = (v))
#define HW_LCD_AR_SET(x, v)      (BME_OR32(HW_LCD_AR_ADDR(x), (uint32_t)(v)))
#define HW_LCD_AR_CLR(x, v)      (BME_AND32(HW_LCD_AR_ADDR(x), (uint32_t)(~(v))))
#define HW_LCD_AR_TOG(x, v)      (BME_XOR32(HW_LCD_AR_ADDR(x), (uint32_t)(v)))
/*@}*/

/*
 * Constants & macros for individual LCD_AR bitfields
 */

/*!
 * @name Register LCD_AR, field BRATE[2:0] (RW)
 *
 * Selects frequency at which the LCD blinks when the BLINK bit is asserted. The
 * following equation provides an expression for the LCD controller blink rate
 * and shows how BRATE field is used in the LCD blink-rate calculation. LCD
 * controller blink rate = LCD clock /2(12 + BRATE)
 */
/*@{*/
#define BP_LCD_AR_BRATE      (0U)          /*!< Bit position for LCD_AR_BRATE. */
#define BM_LCD_AR_BRATE      (0x00000007U) /*!< Bit mask for LCD_AR_BRATE. */
#define BS_LCD_AR_BRATE      (3U)          /*!< Bit field size in bits for LCD_AR_BRATE. */

/*! @brief Read current value of the LCD_AR_BRATE field. */
#define BR_LCD_AR_BRATE(x)   (BME_UBFX32(HW_LCD_AR_ADDR(x), BP_LCD_AR_BRATE, BS_LCD_AR_BRATE))

/*! @brief Format value for bitfield LCD_AR_BRATE. */
#define BF_LCD_AR_BRATE(v)   ((uint32_t)((uint32_t)(v) << BP_LCD_AR_BRATE) & BM_LCD_AR_BRATE)

/*! @brief Set the BRATE field to a new value. */
#define BW_LCD_AR_BRATE(x, v) (BME_BFI32(HW_LCD_AR_ADDR(x), ((uint32_t)(v) << BP_LCD_AR_BRATE), BP_LCD_AR_BRATE, 3))
/*@}*/

/*!
 * @name Register LCD_AR, field BMODE[3] (RW)
 *
 * Selects the blink mode displayed during the blink period.
 *
 * Values:
 * - 0 - Display blank during the blink period.
 * - 1 - Display alternate display during blink period (Ignored if duty is 5 or
 *     greater).
 */
/*@{*/
#define BP_LCD_AR_BMODE      (3U)          /*!< Bit position for LCD_AR_BMODE. */
#define BM_LCD_AR_BMODE      (0x00000008U) /*!< Bit mask for LCD_AR_BMODE. */
#define BS_LCD_AR_BMODE      (1U)          /*!< Bit field size in bits for LCD_AR_BMODE. */

/*! @brief Read current value of the LCD_AR_BMODE field. */
#define BR_LCD_AR_BMODE(x)   (BME_UBFX32(HW_LCD_AR_ADDR(x), BP_LCD_AR_BMODE, BS_LCD_AR_BMODE))

/*! @brief Format value for bitfield LCD_AR_BMODE. */
#define BF_LCD_AR_BMODE(v)   ((uint32_t)((uint32_t)(v) << BP_LCD_AR_BMODE) & BM_LCD_AR_BMODE)

/*! @brief Set the BMODE field to a new value. */
#define BW_LCD_AR_BMODE(x, v) (BME_BFI32(HW_LCD_AR_ADDR(x), ((uint32_t)(v) << BP_LCD_AR_BMODE), BP_LCD_AR_BMODE, 1))
/*@}*/

/*!
 * @name Register LCD_AR, field BLANK[5] (RW)
 *
 * Asserting this bit clears all segments in the LCD.
 *
 * Values:
 * - 0 - Normal or alternate display mode.
 * - 1 - Blank display mode.
 */
/*@{*/
#define BP_LCD_AR_BLANK      (5U)          /*!< Bit position for LCD_AR_BLANK. */
#define BM_LCD_AR_BLANK      (0x00000020U) /*!< Bit mask for LCD_AR_BLANK. */
#define BS_LCD_AR_BLANK      (1U)          /*!< Bit field size in bits for LCD_AR_BLANK. */

/*! @brief Read current value of the LCD_AR_BLANK field. */
#define BR_LCD_AR_BLANK(x)   (BME_UBFX32(HW_LCD_AR_ADDR(x), BP_LCD_AR_BLANK, BS_LCD_AR_BLANK))

/*! @brief Format value for bitfield LCD_AR_BLANK. */
#define BF_LCD_AR_BLANK(v)   ((uint32_t)((uint32_t)(v) << BP_LCD_AR_BLANK) & BM_LCD_AR_BLANK)

/*! @brief Set the BLANK field to a new value. */
#define BW_LCD_AR_BLANK(x, v) (BME_BFI32(HW_LCD_AR_ADDR(x), ((uint32_t)(v) << BP_LCD_AR_BLANK), BP_LCD_AR_BLANK, 1))
/*@}*/

/*!
 * @name Register LCD_AR, field ALT[6] (RW)
 *
 * For four back planes or less, the LCD back plane sequencer changes to output
 * an alternate display. ALT bit is ignored if DUTY[2:0] is 100 or greater.
 *
 * Values:
 * - 0 - Normal display mode.
 * - 1 - Alternate display mode.
 */
/*@{*/
#define BP_LCD_AR_ALT        (6U)          /*!< Bit position for LCD_AR_ALT. */
#define BM_LCD_AR_ALT        (0x00000040U) /*!< Bit mask for LCD_AR_ALT. */
#define BS_LCD_AR_ALT        (1U)          /*!< Bit field size in bits for LCD_AR_ALT. */

