nevinxu/HM502B2/platform/CMSIS/Include/device/MKL33Z4/MKL33Z4_lcd.h
/*! @brief Read current value of the LCD_FDCR_FDEN field. */
#define BR_LCD_FDCR_FDEN(x)  (BME_UBFX32(HW_LCD_FDCR_ADDR(x), BP_LCD_FDCR_FDEN, BS_LCD_FDCR_FDEN))

/*! @brief Format value for bitfield LCD_FDCR_FDEN. */
#define BF_LCD_FDCR_FDEN(v)  ((uint32_t)((uint32_t)(v) << BP_LCD_FDCR_FDEN) & BM_LCD_FDCR_FDEN)

/*! @brief Set the FDEN field to a new value. */
#define BW_LCD_FDCR_FDEN(x, v) (BME_BFI32(HW_LCD_FDCR_ADDR(x), ((uint32_t)(v) << BP_LCD_FDCR_FDEN), BP_LCD_FDCR_FDEN, 1))
/*@}*/

/*!
 * @name Register LCD_FDCR, field FDSWW[11:9] (RW)
 *
 * Specifies the sample window width of fault detection, in number of cycles in
 * the range from 4-512 (Sample window = 4*2 N ).
 *
 * Values:
 * - 0 - Sample window width is 4 sample clock cycles.
 * - 1 - Sample window width is 8 sample clock cycles.
 */
/*@{*/
#define BP_LCD_FDCR_FDSWW    (9U)          /*!< Bit position for LCD_FDCR_FDSWW. */
#define BM_LCD_FDCR_FDSWW    (0x00000E00U) /*!< Bit mask for LCD_FDCR_FDSWW. */
#define BS_LCD_FDCR_FDSWW    (3U)          /*!< Bit field size in bits for LCD_FDCR_FDSWW. */

/*! @brief Read current value of the LCD_FDCR_FDSWW field. */
#define BR_LCD_FDCR_FDSWW(x) (BME_UBFX32(HW_LCD_FDCR_ADDR(x), BP_LCD_FDCR_FDSWW, BS_LCD_FDCR_FDSWW))

/*! @brief Format value for bitfield LCD_FDCR_FDSWW. */
#define BF_LCD_FDCR_FDSWW(v) ((uint32_t)((uint32_t)(v) << BP_LCD_FDCR_FDSWW) & BM_LCD_FDCR_FDSWW)

/*! @brief Set the FDSWW field to a new value. */
#define BW_LCD_FDCR_FDSWW(x, v) (BME_BFI32(HW_LCD_FDCR_ADDR(x), ((uint32_t)(v) << BP_LCD_FDCR_FDSWW), BP_LCD_FDCR_FDSWW, 3))
/*@}*/

/*!
 * @name Register LCD_FDCR, field FDPRS[14:12] (RW)
 *
 * Fault detect sample clock frequency is:
 *
 * Values:
 * - 0 - 1/1 bus clock.
 * - 1 - 1/2 bus clock.
 */
/*@{*/
#define BP_LCD_FDCR_FDPRS    (12U)         /*!< Bit position for LCD_FDCR_FDPRS. */
#define BM_LCD_FDCR_FDPRS    (0x00007000U) /*!< Bit mask for LCD_FDCR_FDPRS. */
#define BS_LCD_FDCR_FDPRS    (3U)          /*!< Bit field size in bits for LCD_FDCR_FDPRS. */

/*! @brief Read current value of the LCD_FDCR_FDPRS field. */
#define BR_LCD_FDCR_FDPRS(x) (BME_UBFX32(HW_LCD_FDCR_ADDR(x), BP_LCD_FDCR_FDPRS, BS_LCD_FDCR_FDPRS))

/*! @brief Format value for bitfield LCD_FDCR_FDPRS. */
#define BF_LCD_FDCR_FDPRS(v) ((uint32_t)((uint32_t)(v) << BP_LCD_FDCR_FDPRS) & BM_LCD_FDCR_FDPRS)

/*! @brief Set the FDPRS field to a new value. */
#define BW_LCD_FDCR_FDPRS(x, v) (BME_BFI32(HW_LCD_FDCR_ADDR(x), ((uint32_t)(v) << BP_LCD_FDCR_FDPRS), BP_LCD_FDCR_FDPRS, 3))
/*@}*/

/*******************************************************************************
 * HW_LCD_FDSR - LCD Fault Detect Status Register
 ******************************************************************************/

/*!
 * @brief HW_LCD_FDSR - LCD Fault Detect Status Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * The reset value of this register depends on the reset type: POR - 0x0000_0000
 */
typedef union _hw_lcd_fdsr
{
    uint32_t U;
    struct _hw_lcd_fdsr_bitfields
    {
        uint32_t FDCNT : 8;            /*!< [7:0] Fault Detect Counter */
        uint32_t RESERVED0 : 7;        /*!< [14:8] Reserved */
        uint32_t FDCF : 1;             /*!< [15] Fault Detection Complete Flag */
        uint32_t RESERVED1 : 16;       /*!< [31:16] Reserved */
    } B;
} hw_lcd_fdsr_t;

/*!
 * @name Constants and macros for entire LCD_FDSR register
 */
/*@{*/
#define HW_LCD_FDSR_ADDR(x)      ((x) + 0xCU)

#define HW_LCD_FDSR(x)           (*(__IO hw_lcd_fdsr_t *) HW_LCD_FDSR_ADDR(x))
#define HW_LCD_FDSR_RD(x)        (HW_LCD_FDSR(x).U)
#define HW_LCD_FDSR_WR(x, v)     (HW_LCD_FDSR(x).U = (v))
#define HW_LCD_FDSR_SET(x, v)    (BME_OR32(HW_LCD_FDSR_ADDR(x), (uint32_t)(v)))
#define HW_LCD_FDSR_CLR(x, v)    (BME_AND32(HW_LCD_FDSR_ADDR(x), (uint32_t)(~(v))))
#define HW_LCD_FDSR_TOG(x, v)    (BME_XOR32(HW_LCD_FDSR_ADDR(x), (uint32_t)(v)))
/*@}*/

/*
 * Constants & macros for individual LCD_FDSR bitfields
 */

/*!
 * @name Register LCD_FDSR, field FDCNT[7:0] (RO)
 *
 * Contains how many "one/high" are sampled inside the fault detect sample
 * window.
 *
 * Values:
 * - 0 - No "one" samples.
 * - 1 - 1 "one" samples.
 */
/*@{*/
#define BP_LCD_FDSR_FDCNT    (0U)          /*!< Bit position for LCD_FDSR_FDCNT. */
#define BM_LCD_FDSR_FDCNT    (0x000000FFU) /*!< Bit mask for LCD_FDSR_FDCNT. */
#define BS_LCD_FDSR_FDCNT    (8U)          /*!< Bit field size in bits for LCD_FDSR_FDCNT. */

/*! @brief Read current value of the LCD_FDSR_FDCNT field. */
#define BR_LCD_FDSR_FDCNT(x) (BME_UBFX32(HW_LCD_FDSR_ADDR(x), BP_LCD_FDSR_FDCNT, BS_LCD_FDSR_FDCNT))
/*@}*/

/*!
 * @name Register LCD_FDSR, field FDCF[15] (W1C)
 *
 * FDCF indicates that the fault detection is completed. Writing 1 to this bit
 * clears it to zero. This bit also acts as an interrupt flag when FDCIEN is set.
 * Software can use either interrupt or polling to check whether one pin fault
 * detection is completed.
 *
 * Values:
 * - 0 - Fault detection is not completed.
 * - 1 - Fault detection is completed.
 */
/*@{*/
#define BP_LCD_FDSR_FDCF     (15U)         /*!< Bit position for LCD_FDSR_FDCF. */
#define BM_LCD_FDSR_FDCF     (0x00008000U) /*!< Bit mask for LCD_FDSR_FDCF. */
#define BS_LCD_FDSR_FDCF     (1U)          /*!< Bit field size in bits for LCD_FDSR_FDCF. */

/*! @brief Read current value of the LCD_FDSR_FDCF field. */
#define BR_LCD_FDSR_FDCF(x)  (BME_UBFX32(HW_LCD_FDSR_ADDR(x), BP_LCD_FDSR_FDCF, BS_LCD_FDSR_FDCF))

/*! @brief Format value for bitfield LCD_FDSR_FDCF. */
#define BF_LCD_FDSR_FDCF(v)  ((uint32_t)((uint32_t)(v) << BP_LCD_FDSR_FDCF) & BM_LCD_FDSR_FDCF)

/*! @brief Set the FDCF field to a new value. */
#define BW_LCD_FDSR_FDCF(x, v) (BME_BFI32(HW_LCD_FDSR_ADDR(x), ((uint32_t)(v) << BP_LCD_FDSR_FDCF), BP_LCD_FDSR_FDCF, 1))
/*@}*/

/*******************************************************************************
 * HW_LCD_PENL - LCD Pin Enable register
 ******************************************************************************/

/*!
 * @brief HW_LCD_PENL - LCD Pin Enable register (RW)
 *
 * Reset value: 0x00000000U
 *
 * When LCDEN = 1,and PAD_SAFE=0 each PEN bit enables the corresponding LCD pin
 * (LCD_Pn) for LCD waveform generation.When LCDEN=0, each PEN bit enabled to
 * corresponding LCD pin (LCD_Pn) to drive a low output. Initialize these registers
 * before enabling the LCD controller. The reset value of this register depends
 * on the reset type: POR - 0x0000_0000
 */
typedef union _hw_lcd_penl
{
    uint32_t U;
    struct _hw_lcd_penl_bitfields
    {
        uint32_t PEN : 32;             /*!< [31:0] LCD Pin Enable */
    } B;
} hw_lcd_penl_t;

/*!
 * @name Constants and macros for entire LCD_PENL register
 */
/*@{*/
#define HW_LCD_PENL_ADDR(x)      ((x) + 0x10U)

