nevinxu/HM502B2/platform/CMSIS/Include/device/MKL33Z4/MKL33Z4_lcd.h
/*! @brief Read current value of the LCD_WF7TO4_WF4 field. */
#define BR_LCD_WF7TO4_WF4(x) (BME_UBFX32(HW_LCD_WF7TO4_ADDR(x), BP_LCD_WF7TO4_WF4, BS_LCD_WF7TO4_WF4))

/*! @brief Format value for bitfield LCD_WF7TO4_WF4. */
#define BF_LCD_WF7TO4_WF4(v) ((uint32_t)((uint32_t)(v) << BP_LCD_WF7TO4_WF4) & BM_LCD_WF7TO4_WF4)

/*! @brief Set the WF4 field to a new value. */
#define BW_LCD_WF7TO4_WF4(x, v) (BME_BFI32(HW_LCD_WF7TO4_ADDR(x), ((uint32_t)(v) << BP_LCD_WF7TO4_WF4), BP_LCD_WF7TO4_WF4, 8))
/*@}*/

/*!
 * @name Register LCD_WF7TO4, field WF5[15:8] (RW)
 *
 * Controls segments or phases connected to LCD_P5 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
#define BP_LCD_WF7TO4_WF5    (8U)          /*!< Bit position for LCD_WF7TO4_WF5. */
#define BM_LCD_WF7TO4_WF5    (0x0000FF00U) /*!< Bit mask for LCD_WF7TO4_WF5. */
#define BS_LCD_WF7TO4_WF5    (8U)          /*!< Bit field size in bits for LCD_WF7TO4_WF5. */

/*! @brief Read current value of the LCD_WF7TO4_WF5 field. */
#define BR_LCD_WF7TO4_WF5(x) (BME_UBFX32(HW_LCD_WF7TO4_ADDR(x), BP_LCD_WF7TO4_WF5, BS_LCD_WF7TO4_WF5))

/*! @brief Format value for bitfield LCD_WF7TO4_WF5. */
#define BF_LCD_WF7TO4_WF5(v) ((uint32_t)((uint32_t)(v) << BP_LCD_WF7TO4_WF5) & BM_LCD_WF7TO4_WF5)

/*! @brief Set the WF5 field to a new value. */
#define BW_LCD_WF7TO4_WF5(x, v) (BME_BFI32(HW_LCD_WF7TO4_ADDR(x), ((uint32_t)(v) << BP_LCD_WF7TO4_WF5), BP_LCD_WF7TO4_WF5, 8))
/*@}*/

/*!
 * @name Register LCD_WF7TO4, field WF6[23:16] (RW)
 *
 * Controls segments or phases connected to LCD_P6 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
#define BP_LCD_WF7TO4_WF6    (16U)         /*!< Bit position for LCD_WF7TO4_WF6. */
#define BM_LCD_WF7TO4_WF6    (0x00FF0000U) /*!< Bit mask for LCD_WF7TO4_WF6. */
#define BS_LCD_WF7TO4_WF6    (8U)          /*!< Bit field size in bits for LCD_WF7TO4_WF6. */

/*! @brief Read current value of the LCD_WF7TO4_WF6 field. */
#define BR_LCD_WF7TO4_WF6(x) (BME_UBFX32(HW_LCD_WF7TO4_ADDR(x), BP_LCD_WF7TO4_WF6, BS_LCD_WF7TO4_WF6))

/*! @brief Format value for bitfield LCD_WF7TO4_WF6. */
#define BF_LCD_WF7TO4_WF6(v) ((uint32_t)((uint32_t)(v) << BP_LCD_WF7TO4_WF6) & BM_LCD_WF7TO4_WF6)

/*! @brief Set the WF6 field to a new value. */
#define BW_LCD_WF7TO4_WF6(x, v) (BME_BFI32(HW_LCD_WF7TO4_ADDR(x), ((uint32_t)(v) << BP_LCD_WF7TO4_WF6), BP_LCD_WF7TO4_WF6, 8))
/*@}*/

/*!
 * @name Register LCD_WF7TO4, field WF7[31:24] (RW)
 *
 * Controls segments or phases connected to LCD_P7 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
#define BP_LCD_WF7TO4_WF7    (24U)         /*!< Bit position for LCD_WF7TO4_WF7. */
#define BM_LCD_WF7TO4_WF7    (0xFF000000U) /*!< Bit mask for LCD_WF7TO4_WF7. */
#define BS_LCD_WF7TO4_WF7    (8U)          /*!< Bit field size in bits for LCD_WF7TO4_WF7. */

/*! @brief Read current value of the LCD_WF7TO4_WF7 field. */
#define BR_LCD_WF7TO4_WF7(x) (BME_UBFX32(HW_LCD_WF7TO4_ADDR(x), BP_LCD_WF7TO4_WF7, BS_LCD_WF7TO4_WF7))

/*! @brief Format value for bitfield LCD_WF7TO4_WF7. */
#define BF_LCD_WF7TO4_WF7(v) ((uint32_t)((uint32_t)(v) << BP_LCD_WF7TO4_WF7) & BM_LCD_WF7TO4_WF7)

/*! @brief Set the WF7 field to a new value. */
#define BW_LCD_WF7TO4_WF7(x, v) (BME_BFI32(HW_LCD_WF7TO4_ADDR(x), ((uint32_t)(v) << BP_LCD_WF7TO4_WF7), BP_LCD_WF7TO4_WF7, 8))
/*@}*/
/*******************************************************************************
 * HW_LCD_WF11TO8 - LCD Waveform register
 ******************************************************************************/

/*!
 * @brief HW_LCD_WF11TO8 - LCD Waveform register (RW)
 *
 * Reset value: 0x00000000U
 *
 * See the LCD Waveform register (WFC3TO0) for register and field descriptions.
 * The reset value of this register depends on the reset type: POR - 0x0000_0000
 */
typedef union _hw_lcd_wf11to8
{
    uint32_t U;
    struct _hw_lcd_wf11to8_bitfields
    {
        uint32_t WF8 : 8;              /*!< [7:0]  */
        uint32_t WF9 : 8;              /*!< [15:8]  */
        uint32_t WF10 : 8;             /*!< [23:16]  */
        uint32_t WF11 : 8;             /*!< [31:24]  */
    } B;
} hw_lcd_wf11to8_t;

/*!
 * @name Constants and macros for entire LCD_WF11TO8 register
 */
/*@{*/
#define HW_LCD_WF11TO8_ADDR(x)   ((x) + 0x28U)

#define HW_LCD_WF11TO8(x)        (*(__IO hw_lcd_wf11to8_t *) HW_LCD_WF11TO8_ADDR(x))
#define HW_LCD_WF11TO8_RD(x)     (HW_LCD_WF11TO8(x).U)
#define HW_LCD_WF11TO8_WR(x, v)  (HW_LCD_WF11TO8(x).U = (v))
#define HW_LCD_WF11TO8_SET(x, v) (BME_OR32(HW_LCD_WF11TO8_ADDR(x), (uint32_t)(v)))
#define HW_LCD_WF11TO8_CLR(x, v) (BME_AND32(HW_LCD_WF11TO8_ADDR(x), (uint32_t)(~(v))))
#define HW_LCD_WF11TO8_TOG(x, v) (BME_XOR32(HW_LCD_WF11TO8_ADDR(x), (uint32_t)(v)))
/*@}*/

/*
 * Constants & macros for individual LCD_WF11TO8 bitfields
 */

/*!
 * @name Register LCD_WF11TO8, field WF8[7:0] (RW)
 *
 * Controls segments or phases connected to LCD_P8 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
#define BP_LCD_WF11TO8_WF8   (0U)          /*!< Bit position for LCD_WF11TO8_WF8. */
#define BM_LCD_WF11TO8_WF8   (0x000000FFU) /*!< Bit mask for LCD_WF11TO8_WF8. */
#define BS_LCD_WF11TO8_WF8   (8U)          /*!< Bit field size in bits for LCD_WF11TO8_WF8. */

/*! @brief Read current value of the LCD_WF11TO8_WF8 field. */
#define BR_LCD_WF11TO8_WF8(x) (BME_UBFX32(HW_LCD_WF11TO8_ADDR(x), BP_LCD_WF11TO8_WF8, BS_LCD_WF11TO8_WF8))

/*! @brief Format value for bitfield LCD_WF11TO8_WF8. */
#define BF_LCD_WF11TO8_WF8(v) ((uint32_t)((uint32_t)(v) << BP_LCD_WF11TO8_WF8) & BM_LCD_WF11TO8_WF8)

/*! @brief Set the WF8 field to a new value. */
#define BW_LCD_WF11TO8_WF8(x, v) (BME_BFI32(HW_LCD_WF11TO8_ADDR(x), ((uint32_t)(v) << BP_LCD_WF11TO8_WF8), BP_LCD_WF11TO8_WF8, 8))
/*@}*/

/*!
 * @name Register LCD_WF11TO8, field WF9[15:8] (RW)
 *
 * Controls segments or phases connected to LCD_P9 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
#define BP_LCD_WF11TO8_WF9   (8U)          /*!< Bit position for LCD_WF11TO8_WF9. */
#define BM_LCD_WF11TO8_WF9   (0x0000FF00U) /*!< Bit mask for LCD_WF11TO8_WF9. */
#define BS_LCD_WF11TO8_WF9   (8U)          /*!< Bit field size in bits for LCD_WF11TO8_WF9. */

/*! @brief Read current value of the LCD_WF11TO8_WF9 field. */
#define BR_LCD_WF11TO8_WF9(x) (BME_UBFX32(HW_LCD_WF11TO8_ADDR(x), BP_LCD_WF11TO8_WF9, BS_LCD_WF11TO8_WF9))

/*! @brief Format value for bitfield LCD_WF11TO8_WF9. */
#define BF_LCD_WF11TO8_WF9(v) ((uint32_t)((uint32_t)(v) << BP_LCD_WF11TO8_WF9) & BM_LCD_WF11TO8_WF9)

