nevinxu/HM502B2/platform/CMSIS/Include/device/MKL33Z4/MKL33Z4_lcd.h
/*! @brief Set the WF9 field to a new value. */
#define BW_LCD_WF11TO8_WF9(x, v) (BME_BFI32(HW_LCD_WF11TO8_ADDR(x), ((uint32_t)(v) << BP_LCD_WF11TO8_WF9), BP_LCD_WF11TO8_WF9, 8))
/*@}*/

/*!
 * @name Register LCD_WF11TO8, field WF10[23:16] (RW)
 *
 * Controls segments or phases connected to LCD_P10 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
#define BP_LCD_WF11TO8_WF10  (16U)         /*!< Bit position for LCD_WF11TO8_WF10. */
#define BM_LCD_WF11TO8_WF10  (0x00FF0000U) /*!< Bit mask for LCD_WF11TO8_WF10. */
#define BS_LCD_WF11TO8_WF10  (8U)          /*!< Bit field size in bits for LCD_WF11TO8_WF10. */

/*! @brief Read current value of the LCD_WF11TO8_WF10 field. */
#define BR_LCD_WF11TO8_WF10(x) (BME_UBFX32(HW_LCD_WF11TO8_ADDR(x), BP_LCD_WF11TO8_WF10, BS_LCD_WF11TO8_WF10))

/*! @brief Format value for bitfield LCD_WF11TO8_WF10. */
#define BF_LCD_WF11TO8_WF10(v) ((uint32_t)((uint32_t)(v) << BP_LCD_WF11TO8_WF10) & BM_LCD_WF11TO8_WF10)

/*! @brief Set the WF10 field to a new value. */
#define BW_LCD_WF11TO8_WF10(x, v) (BME_BFI32(HW_LCD_WF11TO8_ADDR(x), ((uint32_t)(v) << BP_LCD_WF11TO8_WF10), BP_LCD_WF11TO8_WF10, 8))
/*@}*/

/*!
 * @name Register LCD_WF11TO8, field WF11[31:24] (RW)
 *
 * Controls segments or phases connected to LCD_P11 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
#define BP_LCD_WF11TO8_WF11  (24U)         /*!< Bit position for LCD_WF11TO8_WF11. */
#define BM_LCD_WF11TO8_WF11  (0xFF000000U) /*!< Bit mask for LCD_WF11TO8_WF11. */
#define BS_LCD_WF11TO8_WF11  (8U)          /*!< Bit field size in bits for LCD_WF11TO8_WF11. */

/*! @brief Read current value of the LCD_WF11TO8_WF11 field. */
#define BR_LCD_WF11TO8_WF11(x) (BME_UBFX32(HW_LCD_WF11TO8_ADDR(x), BP_LCD_WF11TO8_WF11, BS_LCD_WF11TO8_WF11))

/*! @brief Format value for bitfield LCD_WF11TO8_WF11. */
#define BF_LCD_WF11TO8_WF11(v) ((uint32_t)((uint32_t)(v) << BP_LCD_WF11TO8_WF11) & BM_LCD_WF11TO8_WF11)

/*! @brief Set the WF11 field to a new value. */
#define BW_LCD_WF11TO8_WF11(x, v) (BME_BFI32(HW_LCD_WF11TO8_ADDR(x), ((uint32_t)(v) << BP_LCD_WF11TO8_WF11), BP_LCD_WF11TO8_WF11, 8))
/*@}*/
/*******************************************************************************
 * HW_LCD_WF15TO12 - LCD Waveform register
 ******************************************************************************/

/*!
 * @brief HW_LCD_WF15TO12 - LCD Waveform register (RW)
 *
 * Reset value: 0x00000000U
 *
 * See the LCD Waveform register (WFC3TO0) for register and field descriptions.
 * The reset value of this register depends on the reset type: POR - 0x0000_0000
 */
typedef union _hw_lcd_wf15to12
{
    uint32_t U;
    struct _hw_lcd_wf15to12_bitfields
    {
        uint32_t WF12 : 8;             /*!< [7:0]  */
        uint32_t WF13 : 8;             /*!< [15:8]  */
        uint32_t WF14 : 8;             /*!< [23:16]  */
        uint32_t WF15 : 8;             /*!< [31:24]  */
    } B;
} hw_lcd_wf15to12_t;

/*!
 * @name Constants and macros for entire LCD_WF15TO12 register
 */
/*@{*/
#define HW_LCD_WF15TO12_ADDR(x)  ((x) + 0x2CU)

#define HW_LCD_WF15TO12(x)       (*(__IO hw_lcd_wf15to12_t *) HW_LCD_WF15TO12_ADDR(x))
#define HW_LCD_WF15TO12_RD(x)    (HW_LCD_WF15TO12(x).U)
#define HW_LCD_WF15TO12_WR(x, v) (HW_LCD_WF15TO12(x).U = (v))
#define HW_LCD_WF15TO12_SET(x, v) (BME_OR32(HW_LCD_WF15TO12_ADDR(x), (uint32_t)(v)))
#define HW_LCD_WF15TO12_CLR(x, v) (BME_AND32(HW_LCD_WF15TO12_ADDR(x), (uint32_t)(~(v))))
#define HW_LCD_WF15TO12_TOG(x, v) (BME_XOR32(HW_LCD_WF15TO12_ADDR(x), (uint32_t)(v)))
/*@}*/

/*
 * Constants & macros for individual LCD_WF15TO12 bitfields
 */

/*!
 * @name Register LCD_WF15TO12, field WF12[7:0] (RW)
 *
 * Controls segments or phases connected to LCD_P12 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
#define BP_LCD_WF15TO12_WF12 (0U)          /*!< Bit position for LCD_WF15TO12_WF12. */
#define BM_LCD_WF15TO12_WF12 (0x000000FFU) /*!< Bit mask for LCD_WF15TO12_WF12. */
#define BS_LCD_WF15TO12_WF12 (8U)          /*!< Bit field size in bits for LCD_WF15TO12_WF12. */

/*! @brief Read current value of the LCD_WF15TO12_WF12 field. */
#define BR_LCD_WF15TO12_WF12(x) (BME_UBFX32(HW_LCD_WF15TO12_ADDR(x), BP_LCD_WF15TO12_WF12, BS_LCD_WF15TO12_WF12))

/*! @brief Format value for bitfield LCD_WF15TO12_WF12. */
#define BF_LCD_WF15TO12_WF12(v) ((uint32_t)((uint32_t)(v) << BP_LCD_WF15TO12_WF12) & BM_LCD_WF15TO12_WF12)

/*! @brief Set the WF12 field to a new value. */
#define BW_LCD_WF15TO12_WF12(x, v) (BME_BFI32(HW_LCD_WF15TO12_ADDR(x), ((uint32_t)(v) << BP_LCD_WF15TO12_WF12), BP_LCD_WF15TO12_WF12, 8))
/*@}*/

/*!
 * @name Register LCD_WF15TO12, field WF13[15:8] (RW)
 *
 * Controls segments or phases connected to LCD_P13 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
#define BP_LCD_WF15TO12_WF13 (8U)          /*!< Bit position for LCD_WF15TO12_WF13. */
#define BM_LCD_WF15TO12_WF13 (0x0000FF00U) /*!< Bit mask for LCD_WF15TO12_WF13. */
#define BS_LCD_WF15TO12_WF13 (8U)          /*!< Bit field size in bits for LCD_WF15TO12_WF13. */

/*! @brief Read current value of the LCD_WF15TO12_WF13 field. */
#define BR_LCD_WF15TO12_WF13(x) (BME_UBFX32(HW_LCD_WF15TO12_ADDR(x), BP_LCD_WF15TO12_WF13, BS_LCD_WF15TO12_WF13))

/*! @brief Format value for bitfield LCD_WF15TO12_WF13. */
#define BF_LCD_WF15TO12_WF13(v) ((uint32_t)((uint32_t)(v) << BP_LCD_WF15TO12_WF13) & BM_LCD_WF15TO12_WF13)

/*! @brief Set the WF13 field to a new value. */
#define BW_LCD_WF15TO12_WF13(x, v) (BME_BFI32(HW_LCD_WF15TO12_ADDR(x), ((uint32_t)(v) << BP_LCD_WF15TO12_WF13), BP_LCD_WF15TO12_WF13, 8))
/*@}*/

/*!
 * @name Register LCD_WF15TO12, field WF14[23:16] (RW)
 *
 * Controls segments or phases connected to LCD_P14 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
#define BP_LCD_WF15TO12_WF14 (16U)         /*!< Bit position for LCD_WF15TO12_WF14. */
#define BM_LCD_WF15TO12_WF14 (0x00FF0000U) /*!< Bit mask for LCD_WF15TO12_WF14. */
#define BS_LCD_WF15TO12_WF14 (8U)          /*!< Bit field size in bits for LCD_WF15TO12_WF14. */

/*! @brief Read current value of the LCD_WF15TO12_WF14 field. */
#define BR_LCD_WF15TO12_WF14(x) (BME_UBFX32(HW_LCD_WF15TO12_ADDR(x), BP_LCD_WF15TO12_WF14, BS_LCD_WF15TO12_WF14))

/*! @brief Format value for bitfield LCD_WF15TO12_WF14. */
#define BF_LCD_WF15TO12_WF14(v) ((uint32_t)((uint32_t)(v) << BP_LCD_WF15TO12_WF14) & BM_LCD_WF15TO12_WF14)

/*! @brief Set the WF14 field to a new value. */
#define BW_LCD_WF15TO12_WF14(x, v) (BME_BFI32(HW_LCD_WF15TO12_ADDR(x), ((uint32_t)(v) << BP_LCD_WF15TO12_WF14), BP_LCD_WF15TO12_WF14, 8))
/*@}*/

/*!
 * @name Register LCD_WF15TO12, field WF15[31:24] (RW)
 *
 * Controls segments or phases connected to LCD_P15 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
#define BP_LCD_WF15TO12_WF15 (24U)         /*!< Bit position for LCD_WF15TO12_WF15. */
#define BM_LCD_WF15TO12_WF15 (0xFF000000U) /*!< Bit mask for LCD_WF15TO12_WF15. */
#define BS_LCD_WF15TO12_WF15 (8U)          /*!< Bit field size in bits for LCD_WF15TO12_WF15. */

/*! @brief Read current value of the LCD_WF15TO12_WF15 field. */
#define BR_LCD_WF15TO12_WF15(x) (BME_UBFX32(HW_LCD_WF15TO12_ADDR(x), BP_LCD_WF15TO12_WF15, BS_LCD_WF15TO12_WF15))

/*! @brief Format value for bitfield LCD_WF15TO12_WF15. */
#define BF_LCD_WF15TO12_WF15(v) ((uint32_t)((uint32_t)(v) << BP_LCD_WF15TO12_WF15) & BM_LCD_WF15TO12_WF15)

/*! @brief Set the WF15 field to a new value. */
#define BW_LCD_WF15TO12_WF15(x, v) (BME_BFI32(HW_LCD_WF15TO12_ADDR(x), ((uint32_t)(v) << BP_LCD_WF15TO12_WF15), BP_LCD_WF15TO12_WF15, 8))
/*@}*/
/*******************************************************************************
 * HW_LCD_WF19TO16 - LCD Waveform register
 ******************************************************************************/

/*!
 * @brief HW_LCD_WF19TO16 - LCD Waveform register (RW)
 *
 * Reset value: 0x00000000U
 *
 * See the LCD Waveform register (WFC3TO0) for register and field descriptions.
 * The reset value of this register depends on the reset type: POR - 0x0000_0000
 */
typedef union _hw_lcd_wf19to16
{
    uint32_t U;
    struct _hw_lcd_wf19to16_bitfields
    {
        uint32_t WF16 : 8;             /*!< [7:0]  */
        uint32_t WF17 : 8;             /*!< [15:8]  */
        uint32_t WF18 : 8;             /*!< [23:16]  */
        uint32_t WF19 : 8;             /*!< [31:24]  */
    } B;
} hw_lcd_wf19to16_t;

/*!
 * @name Constants and macros for entire LCD_WF19TO16 register
 */
/*@{*/
#define HW_LCD_WF19TO16_ADDR(x)  ((x) + 0x30U)

#define HW_LCD_WF19TO16(x)       (*(__IO hw_lcd_wf19to16_t *) HW_LCD_WF19TO16_ADDR(x))
#define HW_LCD_WF19TO16_RD(x)    (HW_LCD_WF19TO16(x).U)
#define HW_LCD_WF19TO16_WR(x, v) (HW_LCD_WF19TO16(x).U = (v))
#define HW_LCD_WF19TO16_SET(x, v) (BME_OR32(HW_LCD_WF19TO16_ADDR(x), (uint32_t)(v)))
#define HW_LCD_WF19TO16_CLR(x, v) (BME_AND32(HW_LCD_WF19TO16_ADDR(x), (uint32_t)(~(v))))
#define HW_LCD_WF19TO16_TOG(x, v) (BME_XOR32(HW_LCD_WF19TO16_ADDR(x), (uint32_t)(v)))
/*@}*/

