nevinxu/HM502B2/platform/CMSIS/Include/device/MKL33Z4/MKL33Z4_lcd.h
/*! @brief Set the WF37 field to a new value. */
#define BW_LCD_WF39TO36_WF37(x, v) (BME_BFI32(HW_LCD_WF39TO36_ADDR(x), ((uint32_t)(v) << BP_LCD_WF39TO36_WF37), BP_LCD_WF39TO36_WF37, 8))
/*@}*/

/*!
 * @name Register LCD_WF39TO36, field WF38[23:16] (RW)
 *
 * Controls segments or phases connected to LCD_P38 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
#define BP_LCD_WF39TO36_WF38 (16U)         /*!< Bit position for LCD_WF39TO36_WF38. */
#define BM_LCD_WF39TO36_WF38 (0x00FF0000U) /*!< Bit mask for LCD_WF39TO36_WF38. */
#define BS_LCD_WF39TO36_WF38 (8U)          /*!< Bit field size in bits for LCD_WF39TO36_WF38. */

/*! @brief Read current value of the LCD_WF39TO36_WF38 field. */
#define BR_LCD_WF39TO36_WF38(x) (BME_UBFX32(HW_LCD_WF39TO36_ADDR(x), BP_LCD_WF39TO36_WF38, BS_LCD_WF39TO36_WF38))

/*! @brief Format value for bitfield LCD_WF39TO36_WF38. */
#define BF_LCD_WF39TO36_WF38(v) ((uint32_t)((uint32_t)(v) << BP_LCD_WF39TO36_WF38) & BM_LCD_WF39TO36_WF38)

/*! @brief Set the WF38 field to a new value. */
#define BW_LCD_WF39TO36_WF38(x, v) (BME_BFI32(HW_LCD_WF39TO36_ADDR(x), ((uint32_t)(v) << BP_LCD_WF39TO36_WF38), BP_LCD_WF39TO36_WF38, 8))
/*@}*/

/*!
 * @name Register LCD_WF39TO36, field WF39[31:24] (RW)
 *
 * Controls segments or phases connected to LCD_P39 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
#define BP_LCD_WF39TO36_WF39 (24U)         /*!< Bit position for LCD_WF39TO36_WF39. */
#define BM_LCD_WF39TO36_WF39 (0xFF000000U) /*!< Bit mask for LCD_WF39TO36_WF39. */
#define BS_LCD_WF39TO36_WF39 (8U)          /*!< Bit field size in bits for LCD_WF39TO36_WF39. */

/*! @brief Read current value of the LCD_WF39TO36_WF39 field. */
#define BR_LCD_WF39TO36_WF39(x) (BME_UBFX32(HW_LCD_WF39TO36_ADDR(x), BP_LCD_WF39TO36_WF39, BS_LCD_WF39TO36_WF39))

/*! @brief Format value for bitfield LCD_WF39TO36_WF39. */
#define BF_LCD_WF39TO36_WF39(v) ((uint32_t)((uint32_t)(v) << BP_LCD_WF39TO36_WF39) & BM_LCD_WF39TO36_WF39)

/*! @brief Set the WF39 field to a new value. */
#define BW_LCD_WF39TO36_WF39(x, v) (BME_BFI32(HW_LCD_WF39TO36_ADDR(x), ((uint32_t)(v) << BP_LCD_WF39TO36_WF39), BP_LCD_WF39TO36_WF39, 8))
/*@}*/
/*******************************************************************************
 * HW_LCD_WF43TO40 - LCD Waveform register
 ******************************************************************************/

/*!
 * @brief HW_LCD_WF43TO40 - LCD Waveform register (RW)
 *
 * Reset value: 0x00000000U
 *
 * See the LCD Waveform register (WFC3TO0) for register and field descriptions.
 * The reset value of this register depends on the reset type: POR - 0x0000_0000
 */
typedef union _hw_lcd_wf43to40
{
    uint32_t U;
    struct _hw_lcd_wf43to40_bitfields
    {
        uint32_t WF40 : 8;             /*!< [7:0]  */
        uint32_t WF41 : 8;             /*!< [15:8]  */
        uint32_t WF42 : 8;             /*!< [23:16]  */
        uint32_t WF43 : 8;             /*!< [31:24]  */
    } B;
} hw_lcd_wf43to40_t;

/*!
 * @name Constants and macros for entire LCD_WF43TO40 register
 */
/*@{*/
#define HW_LCD_WF43TO40_ADDR(x)  ((x) + 0x48U)

#define HW_LCD_WF43TO40(x)       (*(__IO hw_lcd_wf43to40_t *) HW_LCD_WF43TO40_ADDR(x))
#define HW_LCD_WF43TO40_RD(x)    (HW_LCD_WF43TO40(x).U)
#define HW_LCD_WF43TO40_WR(x, v) (HW_LCD_WF43TO40(x).U = (v))
#define HW_LCD_WF43TO40_SET(x, v) (BME_OR32(HW_LCD_WF43TO40_ADDR(x), (uint32_t)(v)))
#define HW_LCD_WF43TO40_CLR(x, v) (BME_AND32(HW_LCD_WF43TO40_ADDR(x), (uint32_t)(~(v))))
#define HW_LCD_WF43TO40_TOG(x, v) (BME_XOR32(HW_LCD_WF43TO40_ADDR(x), (uint32_t)(v)))
/*@}*/

/*
 * Constants & macros for individual LCD_WF43TO40 bitfields
 */

/*!
 * @name Register LCD_WF43TO40, field WF40[7:0] (RW)
 *
 * Controls segments or phases connected to LCD_P40 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
#define BP_LCD_WF43TO40_WF40 (0U)          /*!< Bit position for LCD_WF43TO40_WF40. */
#define BM_LCD_WF43TO40_WF40 (0x000000FFU) /*!< Bit mask for LCD_WF43TO40_WF40. */
#define BS_LCD_WF43TO40_WF40 (8U)          /*!< Bit field size in bits for LCD_WF43TO40_WF40. */

/*! @brief Read current value of the LCD_WF43TO40_WF40 field. */
#define BR_LCD_WF43TO40_WF40(x) (BME_UBFX32(HW_LCD_WF43TO40_ADDR(x), BP_LCD_WF43TO40_WF40, BS_LCD_WF43TO40_WF40))

/*! @brief Format value for bitfield LCD_WF43TO40_WF40. */
#define BF_LCD_WF43TO40_WF40(v) ((uint32_t)((uint32_t)(v) << BP_LCD_WF43TO40_WF40) & BM_LCD_WF43TO40_WF40)

/*! @brief Set the WF40 field to a new value. */
#define BW_LCD_WF43TO40_WF40(x, v) (BME_BFI32(HW_LCD_WF43TO40_ADDR(x), ((uint32_t)(v) << BP_LCD_WF43TO40_WF40), BP_LCD_WF43TO40_WF40, 8))
/*@}*/

/*!
 * @name Register LCD_WF43TO40, field WF41[15:8] (RW)
 *
 * Controls segments or phases connected to LCD_P41 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
#define BP_LCD_WF43TO40_WF41 (8U)          /*!< Bit position for LCD_WF43TO40_WF41. */
#define BM_LCD_WF43TO40_WF41 (0x0000FF00U) /*!< Bit mask for LCD_WF43TO40_WF41. */
#define BS_LCD_WF43TO40_WF41 (8U)          /*!< Bit field size in bits for LCD_WF43TO40_WF41. */

/*! @brief Read current value of the LCD_WF43TO40_WF41 field. */
#define BR_LCD_WF43TO40_WF41(x) (BME_UBFX32(HW_LCD_WF43TO40_ADDR(x), BP_LCD_WF43TO40_WF41, BS_LCD_WF43TO40_WF41))

/*! @brief Format value for bitfield LCD_WF43TO40_WF41. */
#define BF_LCD_WF43TO40_WF41(v) ((uint32_t)((uint32_t)(v) << BP_LCD_WF43TO40_WF41) & BM_LCD_WF43TO40_WF41)

/*! @brief Set the WF41 field to a new value. */
#define BW_LCD_WF43TO40_WF41(x, v) (BME_BFI32(HW_LCD_WF43TO40_ADDR(x), ((uint32_t)(v) << BP_LCD_WF43TO40_WF41), BP_LCD_WF43TO40_WF41, 8))
/*@}*/

/*!
 * @name Register LCD_WF43TO40, field WF42[23:16] (RW)
 *
 * Controls segments or phases connected to LCD_P42 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
#define BP_LCD_WF43TO40_WF42 (16U)         /*!< Bit position for LCD_WF43TO40_WF42. */
#define BM_LCD_WF43TO40_WF42 (0x00FF0000U) /*!< Bit mask for LCD_WF43TO40_WF42. */
#define BS_LCD_WF43TO40_WF42 (8U)          /*!< Bit field size in bits for LCD_WF43TO40_WF42. */

/*! @brief Read current value of the LCD_WF43TO40_WF42 field. */
#define BR_LCD_WF43TO40_WF42(x) (BME_UBFX32(HW_LCD_WF43TO40_ADDR(x), BP_LCD_WF43TO40_WF42, BS_LCD_WF43TO40_WF42))

/*! @brief Format value for bitfield LCD_WF43TO40_WF42. */
#define BF_LCD_WF43TO40_WF42(v) ((uint32_t)((uint32_t)(v) << BP_LCD_WF43TO40_WF42) & BM_LCD_WF43TO40_WF42)

/*! @brief Set the WF42 field to a new value. */
#define BW_LCD_WF43TO40_WF42(x, v) (BME_BFI32(HW_LCD_WF43TO40_ADDR(x), ((uint32_t)(v) << BP_LCD_WF43TO40_WF42), BP_LCD_WF43TO40_WF42, 8))
/*@}*/

/*!
 * @name Register LCD_WF43TO40, field WF43[31:24] (RW)
 *
 * Controls segments or phases connected to LCD_P43 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
#define BP_LCD_WF43TO40_WF43 (24U)         /*!< Bit position for LCD_WF43TO40_WF43. */
#define BM_LCD_WF43TO40_WF43 (0xFF000000U) /*!< Bit mask for LCD_WF43TO40_WF43. */
#define BS_LCD_WF43TO40_WF43 (8U)          /*!< Bit field size in bits for LCD_WF43TO40_WF43. */

/*! @brief Read current value of the LCD_WF43TO40_WF43 field. */
#define BR_LCD_WF43TO40_WF43(x) (BME_UBFX32(HW_LCD_WF43TO40_ADDR(x), BP_LCD_WF43TO40_WF43, BS_LCD_WF43TO40_WF43))

/*! @brief Format value for bitfield LCD_WF43TO40_WF43. */
#define BF_LCD_WF43TO40_WF43(v) ((uint32_t)((uint32_t)(v) << BP_LCD_WF43TO40_WF43) & BM_LCD_WF43TO40_WF43)

