nevinxu/HM502B2/platform/CMSIS/Include/device/MKL33Z4/MKL33Z4_lcd.h
/*! @brief Format value for bitfield LCD_WF11_BPHLCD11. */
#define BF_LCD_WF11_BPHLCD11(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF11_BPHLCD11) & BM_LCD_WF11_BPHLCD11)

/*! @brief Set the BPHLCD11 field to a new value. */
#define BW_LCD_WF11_BPHLCD11(x, v) (BME_BFI8(HW_LCD_WF11_ADDR(x), ((uint8_t)(v) << BP_LCD_WF11_BPHLCD11), BP_LCD_WF11_BPHLCD11, 1))
/*@}*/
/*******************************************************************************
 * HW_LCD_WF12 - LCD Waveform Register 12.
 ******************************************************************************/

/*!
 * @brief HW_LCD_WF12 - LCD Waveform Register 12. (RW)
 *
 * Reset value: 0x00U
 */
typedef union _hw_lcd_wf12
{
    uint8_t U;
    struct _hw_lcd_wf12_bitfields
    {
        uint8_t BPALCD12 : 1;          /*!< [0]  */
        uint8_t BPBLCD12 : 1;          /*!< [1]  */
        uint8_t BPCLCD12 : 1;          /*!< [2]  */
        uint8_t BPDLCD12 : 1;          /*!< [3]  */
        uint8_t BPELCD12 : 1;          /*!< [4]  */
        uint8_t BPFLCD12 : 1;          /*!< [5]  */
        uint8_t BPGLCD12 : 1;          /*!< [6]  */
        uint8_t BPHLCD12 : 1;          /*!< [7]  */
    } B;
} hw_lcd_wf12_t;

/*!
 * @name Constants and macros for entire LCD_WF12 register
 */
/*@{*/
#define HW_LCD_WF12_ADDR(x)      ((x) + 0x2CU)

#define HW_LCD_WF12(x)           (*(__IO hw_lcd_wf12_t *) HW_LCD_WF12_ADDR(x))
#define HW_LCD_WF12_RD(x)        (HW_LCD_WF12(x).U)
#define HW_LCD_WF12_WR(x, v)     (HW_LCD_WF12(x).U = (v))
#define HW_LCD_WF12_SET(x, v)    (BME_OR8(HW_LCD_WF12_ADDR(x), (uint8_t)(v)))
#define HW_LCD_WF12_CLR(x, v)    (BME_AND8(HW_LCD_WF12_ADDR(x), (uint8_t)(~(v))))
#define HW_LCD_WF12_TOG(x, v)    (BME_XOR8(HW_LCD_WF12_ADDR(x), (uint8_t)(v)))
/*@}*/

/*
 * Constants & macros for individual LCD_WF12 bitfields
 */

/*!
 * @name Register LCD_WF12, field BPALCD12[0] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase A
 * - 1 - LCD segment on or LCD backplane active for phase A
 */
/*@{*/
#define BP_LCD_WF12_BPALCD12 (0U)          /*!< Bit position for LCD_WF12_BPALCD12. */
#define BM_LCD_WF12_BPALCD12 (0x01U)       /*!< Bit mask for LCD_WF12_BPALCD12. */
#define BS_LCD_WF12_BPALCD12 (1U)          /*!< Bit field size in bits for LCD_WF12_BPALCD12. */

/*! @brief Read current value of the LCD_WF12_BPALCD12 field. */
#define BR_LCD_WF12_BPALCD12(x) (BME_UBFX8(HW_LCD_WF12_ADDR(x), BP_LCD_WF12_BPALCD12, BS_LCD_WF12_BPALCD12))

/*! @brief Format value for bitfield LCD_WF12_BPALCD12. */
#define BF_LCD_WF12_BPALCD12(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF12_BPALCD12) & BM_LCD_WF12_BPALCD12)

/*! @brief Set the BPALCD12 field to a new value. */
#define BW_LCD_WF12_BPALCD12(x, v) (BME_BFI8(HW_LCD_WF12_ADDR(x), ((uint8_t)(v) << BP_LCD_WF12_BPALCD12), BP_LCD_WF12_BPALCD12, 1))
/*@}*/

/*!
 * @name Register LCD_WF12, field BPBLCD12[1] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase B
 * - 1 - LCD segment on or LCD backplane active for phase B
 */
/*@{*/
#define BP_LCD_WF12_BPBLCD12 (1U)          /*!< Bit position for LCD_WF12_BPBLCD12. */
#define BM_LCD_WF12_BPBLCD12 (0x02U)       /*!< Bit mask for LCD_WF12_BPBLCD12. */
#define BS_LCD_WF12_BPBLCD12 (1U)          /*!< Bit field size in bits for LCD_WF12_BPBLCD12. */

/*! @brief Read current value of the LCD_WF12_BPBLCD12 field. */
#define BR_LCD_WF12_BPBLCD12(x) (BME_UBFX8(HW_LCD_WF12_ADDR(x), BP_LCD_WF12_BPBLCD12, BS_LCD_WF12_BPBLCD12))

/*! @brief Format value for bitfield LCD_WF12_BPBLCD12. */
#define BF_LCD_WF12_BPBLCD12(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF12_BPBLCD12) & BM_LCD_WF12_BPBLCD12)

/*! @brief Set the BPBLCD12 field to a new value. */
#define BW_LCD_WF12_BPBLCD12(x, v) (BME_BFI8(HW_LCD_WF12_ADDR(x), ((uint8_t)(v) << BP_LCD_WF12_BPBLCD12), BP_LCD_WF12_BPBLCD12, 1))
/*@}*/

/*!
 * @name Register LCD_WF12, field BPCLCD12[2] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase C
 * - 1 - LCD segment on or LCD backplane active for phase C
 */
/*@{*/
#define BP_LCD_WF12_BPCLCD12 (2U)          /*!< Bit position for LCD_WF12_BPCLCD12. */
#define BM_LCD_WF12_BPCLCD12 (0x04U)       /*!< Bit mask for LCD_WF12_BPCLCD12. */
#define BS_LCD_WF12_BPCLCD12 (1U)          /*!< Bit field size in bits for LCD_WF12_BPCLCD12. */

/*! @brief Read current value of the LCD_WF12_BPCLCD12 field. */
#define BR_LCD_WF12_BPCLCD12(x) (BME_UBFX8(HW_LCD_WF12_ADDR(x), BP_LCD_WF12_BPCLCD12, BS_LCD_WF12_BPCLCD12))

/*! @brief Format value for bitfield LCD_WF12_BPCLCD12. */
#define BF_LCD_WF12_BPCLCD12(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF12_BPCLCD12) & BM_LCD_WF12_BPCLCD12)

/*! @brief Set the BPCLCD12 field to a new value. */
#define BW_LCD_WF12_BPCLCD12(x, v) (BME_BFI8(HW_LCD_WF12_ADDR(x), ((uint8_t)(v) << BP_LCD_WF12_BPCLCD12), BP_LCD_WF12_BPCLCD12, 1))
/*@}*/

/*!
 * @name Register LCD_WF12, field BPDLCD12[3] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase D
 * - 1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
#define BP_LCD_WF12_BPDLCD12 (3U)          /*!< Bit position for LCD_WF12_BPDLCD12. */
#define BM_LCD_WF12_BPDLCD12 (0x08U)       /*!< Bit mask for LCD_WF12_BPDLCD12. */
#define BS_LCD_WF12_BPDLCD12 (1U)          /*!< Bit field size in bits for LCD_WF12_BPDLCD12. */

/*! @brief Read current value of the LCD_WF12_BPDLCD12 field. */
#define BR_LCD_WF12_BPDLCD12(x) (BME_UBFX8(HW_LCD_WF12_ADDR(x), BP_LCD_WF12_BPDLCD12, BS_LCD_WF12_BPDLCD12))

/*! @brief Format value for bitfield LCD_WF12_BPDLCD12. */
#define BF_LCD_WF12_BPDLCD12(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF12_BPDLCD12) & BM_LCD_WF12_BPDLCD12)

/*! @brief Set the BPDLCD12 field to a new value. */
#define BW_LCD_WF12_BPDLCD12(x, v) (BME_BFI8(HW_LCD_WF12_ADDR(x), ((uint8_t)(v) << BP_LCD_WF12_BPDLCD12), BP_LCD_WF12_BPDLCD12, 1))
/*@}*/

/*!
 * @name Register LCD_WF12, field BPELCD12[4] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase E
 * - 1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
#define BP_LCD_WF12_BPELCD12 (4U)          /*!< Bit position for LCD_WF12_BPELCD12. */
#define BM_LCD_WF12_BPELCD12 (0x10U)       /*!< Bit mask for LCD_WF12_BPELCD12. */
#define BS_LCD_WF12_BPELCD12 (1U)          /*!< Bit field size in bits for LCD_WF12_BPELCD12. */

/*! @brief Read current value of the LCD_WF12_BPELCD12 field. */
#define BR_LCD_WF12_BPELCD12(x) (BME_UBFX8(HW_LCD_WF12_ADDR(x), BP_LCD_WF12_BPELCD12, BS_LCD_WF12_BPELCD12))

/*! @brief Format value for bitfield LCD_WF12_BPELCD12. */
#define BF_LCD_WF12_BPELCD12(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF12_BPELCD12) & BM_LCD_WF12_BPELCD12)

