nevinxu/HM502B2/platform/CMSIS/Include/device/MKL33Z4/MKL33Z4_lcd.h
/*! @brief Set the BPELCD12 field to a new value. */
#define BW_LCD_WF12_BPELCD12(x, v) (BME_BFI8(HW_LCD_WF12_ADDR(x), ((uint8_t)(v) << BP_LCD_WF12_BPELCD12), BP_LCD_WF12_BPELCD12, 1))
/*@}*/

/*!
 * @name Register LCD_WF12, field BPFLCD12[5] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase F
 * - 1 - LCD segment on or LCD backplane active for phase F
 */
/*@{*/
#define BP_LCD_WF12_BPFLCD12 (5U)          /*!< Bit position for LCD_WF12_BPFLCD12. */
#define BM_LCD_WF12_BPFLCD12 (0x20U)       /*!< Bit mask for LCD_WF12_BPFLCD12. */
#define BS_LCD_WF12_BPFLCD12 (1U)          /*!< Bit field size in bits for LCD_WF12_BPFLCD12. */

/*! @brief Read current value of the LCD_WF12_BPFLCD12 field. */
#define BR_LCD_WF12_BPFLCD12(x) (BME_UBFX8(HW_LCD_WF12_ADDR(x), BP_LCD_WF12_BPFLCD12, BS_LCD_WF12_BPFLCD12))

/*! @brief Format value for bitfield LCD_WF12_BPFLCD12. */
#define BF_LCD_WF12_BPFLCD12(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF12_BPFLCD12) & BM_LCD_WF12_BPFLCD12)

/*! @brief Set the BPFLCD12 field to a new value. */
#define BW_LCD_WF12_BPFLCD12(x, v) (BME_BFI8(HW_LCD_WF12_ADDR(x), ((uint8_t)(v) << BP_LCD_WF12_BPFLCD12), BP_LCD_WF12_BPFLCD12, 1))
/*@}*/

/*!
 * @name Register LCD_WF12, field BPGLCD12[6] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase G
 * - 1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
#define BP_LCD_WF12_BPGLCD12 (6U)          /*!< Bit position for LCD_WF12_BPGLCD12. */
#define BM_LCD_WF12_BPGLCD12 (0x40U)       /*!< Bit mask for LCD_WF12_BPGLCD12. */
#define BS_LCD_WF12_BPGLCD12 (1U)          /*!< Bit field size in bits for LCD_WF12_BPGLCD12. */

/*! @brief Read current value of the LCD_WF12_BPGLCD12 field. */
#define BR_LCD_WF12_BPGLCD12(x) (BME_UBFX8(HW_LCD_WF12_ADDR(x), BP_LCD_WF12_BPGLCD12, BS_LCD_WF12_BPGLCD12))

/*! @brief Format value for bitfield LCD_WF12_BPGLCD12. */
#define BF_LCD_WF12_BPGLCD12(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF12_BPGLCD12) & BM_LCD_WF12_BPGLCD12)

/*! @brief Set the BPGLCD12 field to a new value. */
#define BW_LCD_WF12_BPGLCD12(x, v) (BME_BFI8(HW_LCD_WF12_ADDR(x), ((uint8_t)(v) << BP_LCD_WF12_BPGLCD12), BP_LCD_WF12_BPGLCD12, 1))
/*@}*/

/*!
 * @name Register LCD_WF12, field BPHLCD12[7] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase H
 * - 1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
#define BP_LCD_WF12_BPHLCD12 (7U)          /*!< Bit position for LCD_WF12_BPHLCD12. */
#define BM_LCD_WF12_BPHLCD12 (0x80U)       /*!< Bit mask for LCD_WF12_BPHLCD12. */
#define BS_LCD_WF12_BPHLCD12 (1U)          /*!< Bit field size in bits for LCD_WF12_BPHLCD12. */

/*! @brief Read current value of the LCD_WF12_BPHLCD12 field. */
#define BR_LCD_WF12_BPHLCD12(x) (BME_UBFX8(HW_LCD_WF12_ADDR(x), BP_LCD_WF12_BPHLCD12, BS_LCD_WF12_BPHLCD12))

/*! @brief Format value for bitfield LCD_WF12_BPHLCD12. */
#define BF_LCD_WF12_BPHLCD12(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF12_BPHLCD12) & BM_LCD_WF12_BPHLCD12)

/*! @brief Set the BPHLCD12 field to a new value. */
#define BW_LCD_WF12_BPHLCD12(x, v) (BME_BFI8(HW_LCD_WF12_ADDR(x), ((uint8_t)(v) << BP_LCD_WF12_BPHLCD12), BP_LCD_WF12_BPHLCD12, 1))
/*@}*/
/*******************************************************************************
 * HW_LCD_WF13 - LCD Waveform Register 13.
 ******************************************************************************/

/*!
 * @brief HW_LCD_WF13 - LCD Waveform Register 13. (RW)
 *
 * Reset value: 0x00U
 */
typedef union _hw_lcd_wf13
{
    uint8_t U;
    struct _hw_lcd_wf13_bitfields
    {
        uint8_t BPALCD13 : 1;          /*!< [0]  */
        uint8_t BPBLCD13 : 1;          /*!< [1]  */
        uint8_t BPCLCD13 : 1;          /*!< [2]  */
        uint8_t BPDLCD13 : 1;          /*!< [3]  */
        uint8_t BPELCD13 : 1;          /*!< [4]  */
        uint8_t BPFLCD13 : 1;          /*!< [5]  */
        uint8_t BPGLCD13 : 1;          /*!< [6]  */
        uint8_t BPHLCD13 : 1;          /*!< [7]  */
    } B;
} hw_lcd_wf13_t;

/*!
 * @name Constants and macros for entire LCD_WF13 register
 */
/*@{*/
#define HW_LCD_WF13_ADDR(x)      ((x) + 0x2DU)

#define HW_LCD_WF13(x)           (*(__IO hw_lcd_wf13_t *) HW_LCD_WF13_ADDR(x))
#define HW_LCD_WF13_RD(x)        (HW_LCD_WF13(x).U)
#define HW_LCD_WF13_WR(x, v)     (HW_LCD_WF13(x).U = (v))
#define HW_LCD_WF13_SET(x, v)    (BME_OR8(HW_LCD_WF13_ADDR(x), (uint8_t)(v)))
#define HW_LCD_WF13_CLR(x, v)    (BME_AND8(HW_LCD_WF13_ADDR(x), (uint8_t)(~(v))))
#define HW_LCD_WF13_TOG(x, v)    (BME_XOR8(HW_LCD_WF13_ADDR(x), (uint8_t)(v)))
/*@}*/

/*
 * Constants & macros for individual LCD_WF13 bitfields
 */

/*!
 * @name Register LCD_WF13, field BPALCD13[0] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase A
 * - 1 - LCD segment on or LCD backplane active for phase A
 */
/*@{*/
#define BP_LCD_WF13_BPALCD13 (0U)          /*!< Bit position for LCD_WF13_BPALCD13. */
#define BM_LCD_WF13_BPALCD13 (0x01U)       /*!< Bit mask for LCD_WF13_BPALCD13. */
#define BS_LCD_WF13_BPALCD13 (1U)          /*!< Bit field size in bits for LCD_WF13_BPALCD13. */

/*! @brief Read current value of the LCD_WF13_BPALCD13 field. */
#define BR_LCD_WF13_BPALCD13(x) (BME_UBFX8(HW_LCD_WF13_ADDR(x), BP_LCD_WF13_BPALCD13, BS_LCD_WF13_BPALCD13))

/*! @brief Format value for bitfield LCD_WF13_BPALCD13. */
#define BF_LCD_WF13_BPALCD13(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF13_BPALCD13) & BM_LCD_WF13_BPALCD13)

/*! @brief Set the BPALCD13 field to a new value. */
#define BW_LCD_WF13_BPALCD13(x, v) (BME_BFI8(HW_LCD_WF13_ADDR(x), ((uint8_t)(v) << BP_LCD_WF13_BPALCD13), BP_LCD_WF13_BPALCD13, 1))
/*@}*/

/*!
 * @name Register LCD_WF13, field BPBLCD13[1] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase B
 * - 1 - LCD segment on or LCD backplane active for phase B
 */
/*@{*/
#define BP_LCD_WF13_BPBLCD13 (1U)          /*!< Bit position for LCD_WF13_BPBLCD13. */
#define BM_LCD_WF13_BPBLCD13 (0x02U)       /*!< Bit mask for LCD_WF13_BPBLCD13. */
#define BS_LCD_WF13_BPBLCD13 (1U)          /*!< Bit field size in bits for LCD_WF13_BPBLCD13. */

/*! @brief Read current value of the LCD_WF13_BPBLCD13 field. */
#define BR_LCD_WF13_BPBLCD13(x) (BME_UBFX8(HW_LCD_WF13_ADDR(x), BP_LCD_WF13_BPBLCD13, BS_LCD_WF13_BPBLCD13))

