nevinxu/HM502B2/platform/CMSIS/Include/device/MKL33Z4/MKL33Z4_lcd.h
/*! @brief Read current value of the LCD_WF20_BPGLCD20 field. */
#define BR_LCD_WF20_BPGLCD20(x) (BME_UBFX8(HW_LCD_WF20_ADDR(x), BP_LCD_WF20_BPGLCD20, BS_LCD_WF20_BPGLCD20))

/*! @brief Format value for bitfield LCD_WF20_BPGLCD20. */
#define BF_LCD_WF20_BPGLCD20(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF20_BPGLCD20) & BM_LCD_WF20_BPGLCD20)

/*! @brief Set the BPGLCD20 field to a new value. */
#define BW_LCD_WF20_BPGLCD20(x, v) (BME_BFI8(HW_LCD_WF20_ADDR(x), ((uint8_t)(v) << BP_LCD_WF20_BPGLCD20), BP_LCD_WF20_BPGLCD20, 1))
/*@}*/

/*!
 * @name Register LCD_WF20, field BPHLCD20[7] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase H
 * - 1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
#define BP_LCD_WF20_BPHLCD20 (7U)          /*!< Bit position for LCD_WF20_BPHLCD20. */
#define BM_LCD_WF20_BPHLCD20 (0x80U)       /*!< Bit mask for LCD_WF20_BPHLCD20. */
#define BS_LCD_WF20_BPHLCD20 (1U)          /*!< Bit field size in bits for LCD_WF20_BPHLCD20. */

/*! @brief Read current value of the LCD_WF20_BPHLCD20 field. */
#define BR_LCD_WF20_BPHLCD20(x) (BME_UBFX8(HW_LCD_WF20_ADDR(x), BP_LCD_WF20_BPHLCD20, BS_LCD_WF20_BPHLCD20))

/*! @brief Format value for bitfield LCD_WF20_BPHLCD20. */
#define BF_LCD_WF20_BPHLCD20(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF20_BPHLCD20) & BM_LCD_WF20_BPHLCD20)

/*! @brief Set the BPHLCD20 field to a new value. */
#define BW_LCD_WF20_BPHLCD20(x, v) (BME_BFI8(HW_LCD_WF20_ADDR(x), ((uint8_t)(v) << BP_LCD_WF20_BPHLCD20), BP_LCD_WF20_BPHLCD20, 1))
/*@}*/
/*******************************************************************************
 * HW_LCD_WF21 - LCD Waveform Register 21.
 ******************************************************************************/

/*!
 * @brief HW_LCD_WF21 - LCD Waveform Register 21. (RW)
 *
 * Reset value: 0x00U
 */
typedef union _hw_lcd_wf21
{
    uint8_t U;
    struct _hw_lcd_wf21_bitfields
    {
        uint8_t BPALCD21 : 1;          /*!< [0]  */
        uint8_t BPBLCD21 : 1;          /*!< [1]  */
        uint8_t BPCLCD21 : 1;          /*!< [2]  */
        uint8_t BPDLCD21 : 1;          /*!< [3]  */
        uint8_t BPELCD21 : 1;          /*!< [4]  */
        uint8_t BPFLCD21 : 1;          /*!< [5]  */
        uint8_t BPGLCD21 : 1;          /*!< [6]  */
        uint8_t BPHLCD21 : 1;          /*!< [7]  */
    } B;
} hw_lcd_wf21_t;

/*!
 * @name Constants and macros for entire LCD_WF21 register
 */
/*@{*/
#define HW_LCD_WF21_ADDR(x)      ((x) + 0x35U)

#define HW_LCD_WF21(x)           (*(__IO hw_lcd_wf21_t *) HW_LCD_WF21_ADDR(x))
#define HW_LCD_WF21_RD(x)        (HW_LCD_WF21(x).U)
#define HW_LCD_WF21_WR(x, v)     (HW_LCD_WF21(x).U = (v))
#define HW_LCD_WF21_SET(x, v)    (BME_OR8(HW_LCD_WF21_ADDR(x), (uint8_t)(v)))
#define HW_LCD_WF21_CLR(x, v)    (BME_AND8(HW_LCD_WF21_ADDR(x), (uint8_t)(~(v))))
#define HW_LCD_WF21_TOG(x, v)    (BME_XOR8(HW_LCD_WF21_ADDR(x), (uint8_t)(v)))
/*@}*/

/*
 * Constants & macros for individual LCD_WF21 bitfields
 */

/*!
 * @name Register LCD_WF21, field BPALCD21[0] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase A
 * - 1 - LCD segment on or LCD backplane active for phase A
 */
/*@{*/
#define BP_LCD_WF21_BPALCD21 (0U)          /*!< Bit position for LCD_WF21_BPALCD21. */
#define BM_LCD_WF21_BPALCD21 (0x01U)       /*!< Bit mask for LCD_WF21_BPALCD21. */
#define BS_LCD_WF21_BPALCD21 (1U)          /*!< Bit field size in bits for LCD_WF21_BPALCD21. */

/*! @brief Read current value of the LCD_WF21_BPALCD21 field. */
#define BR_LCD_WF21_BPALCD21(x) (BME_UBFX8(HW_LCD_WF21_ADDR(x), BP_LCD_WF21_BPALCD21, BS_LCD_WF21_BPALCD21))

/*! @brief Format value for bitfield LCD_WF21_BPALCD21. */
#define BF_LCD_WF21_BPALCD21(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF21_BPALCD21) & BM_LCD_WF21_BPALCD21)

/*! @brief Set the BPALCD21 field to a new value. */
#define BW_LCD_WF21_BPALCD21(x, v) (BME_BFI8(HW_LCD_WF21_ADDR(x), ((uint8_t)(v) << BP_LCD_WF21_BPALCD21), BP_LCD_WF21_BPALCD21, 1))
/*@}*/

/*!
 * @name Register LCD_WF21, field BPBLCD21[1] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase B
 * - 1 - LCD segment on or LCD backplane active for phase B
 */
/*@{*/
#define BP_LCD_WF21_BPBLCD21 (1U)          /*!< Bit position for LCD_WF21_BPBLCD21. */
#define BM_LCD_WF21_BPBLCD21 (0x02U)       /*!< Bit mask for LCD_WF21_BPBLCD21. */
#define BS_LCD_WF21_BPBLCD21 (1U)          /*!< Bit field size in bits for LCD_WF21_BPBLCD21. */

/*! @brief Read current value of the LCD_WF21_BPBLCD21 field. */
#define BR_LCD_WF21_BPBLCD21(x) (BME_UBFX8(HW_LCD_WF21_ADDR(x), BP_LCD_WF21_BPBLCD21, BS_LCD_WF21_BPBLCD21))

/*! @brief Format value for bitfield LCD_WF21_BPBLCD21. */
#define BF_LCD_WF21_BPBLCD21(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF21_BPBLCD21) & BM_LCD_WF21_BPBLCD21)

/*! @brief Set the BPBLCD21 field to a new value. */
#define BW_LCD_WF21_BPBLCD21(x, v) (BME_BFI8(HW_LCD_WF21_ADDR(x), ((uint8_t)(v) << BP_LCD_WF21_BPBLCD21), BP_LCD_WF21_BPBLCD21, 1))
/*@}*/

/*!
 * @name Register LCD_WF21, field BPCLCD21[2] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase C
 * - 1 - LCD segment on or LCD backplane active for phase C
 */
/*@{*/
#define BP_LCD_WF21_BPCLCD21 (2U)          /*!< Bit position for LCD_WF21_BPCLCD21. */
#define BM_LCD_WF21_BPCLCD21 (0x04U)       /*!< Bit mask for LCD_WF21_BPCLCD21. */
#define BS_LCD_WF21_BPCLCD21 (1U)          /*!< Bit field size in bits for LCD_WF21_BPCLCD21. */

/*! @brief Read current value of the LCD_WF21_BPCLCD21 field. */
#define BR_LCD_WF21_BPCLCD21(x) (BME_UBFX8(HW_LCD_WF21_ADDR(x), BP_LCD_WF21_BPCLCD21, BS_LCD_WF21_BPCLCD21))

/*! @brief Format value for bitfield LCD_WF21_BPCLCD21. */
#define BF_LCD_WF21_BPCLCD21(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF21_BPCLCD21) & BM_LCD_WF21_BPCLCD21)

/*! @brief Set the BPCLCD21 field to a new value. */
#define BW_LCD_WF21_BPCLCD21(x, v) (BME_BFI8(HW_LCD_WF21_ADDR(x), ((uint8_t)(v) << BP_LCD_WF21_BPCLCD21), BP_LCD_WF21_BPCLCD21, 1))
/*@}*/

/*!
 * @name Register LCD_WF21, field BPDLCD21[3] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase D
 * - 1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
#define BP_LCD_WF21_BPDLCD21 (3U)          /*!< Bit position for LCD_WF21_BPDLCD21. */
#define BM_LCD_WF21_BPDLCD21 (0x08U)       /*!< Bit mask for LCD_WF21_BPDLCD21. */
#define BS_LCD_WF21_BPDLCD21 (1U)          /*!< Bit field size in bits for LCD_WF21_BPDLCD21. */

