nevinxu/HM502B2/platform/CMSIS/Include/device/MKL33Z4/MKL33Z4_lcd.h
/*! @brief Read current value of the LCD_WF23_BPCLCD23 field. */
#define BR_LCD_WF23_BPCLCD23(x) (BME_UBFX8(HW_LCD_WF23_ADDR(x), BP_LCD_WF23_BPCLCD23, BS_LCD_WF23_BPCLCD23))

/*! @brief Format value for bitfield LCD_WF23_BPCLCD23. */
#define BF_LCD_WF23_BPCLCD23(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF23_BPCLCD23) & BM_LCD_WF23_BPCLCD23)

/*! @brief Set the BPCLCD23 field to a new value. */
#define BW_LCD_WF23_BPCLCD23(x, v) (BME_BFI8(HW_LCD_WF23_ADDR(x), ((uint8_t)(v) << BP_LCD_WF23_BPCLCD23), BP_LCD_WF23_BPCLCD23, 1))
/*@}*/

/*!
 * @name Register LCD_WF23, field BPDLCD23[3] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase D
 * - 1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
#define BP_LCD_WF23_BPDLCD23 (3U)          /*!< Bit position for LCD_WF23_BPDLCD23. */
#define BM_LCD_WF23_BPDLCD23 (0x08U)       /*!< Bit mask for LCD_WF23_BPDLCD23. */
#define BS_LCD_WF23_BPDLCD23 (1U)          /*!< Bit field size in bits for LCD_WF23_BPDLCD23. */

/*! @brief Read current value of the LCD_WF23_BPDLCD23 field. */
#define BR_LCD_WF23_BPDLCD23(x) (BME_UBFX8(HW_LCD_WF23_ADDR(x), BP_LCD_WF23_BPDLCD23, BS_LCD_WF23_BPDLCD23))

/*! @brief Format value for bitfield LCD_WF23_BPDLCD23. */
#define BF_LCD_WF23_BPDLCD23(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF23_BPDLCD23) & BM_LCD_WF23_BPDLCD23)

/*! @brief Set the BPDLCD23 field to a new value. */
#define BW_LCD_WF23_BPDLCD23(x, v) (BME_BFI8(HW_LCD_WF23_ADDR(x), ((uint8_t)(v) << BP_LCD_WF23_BPDLCD23), BP_LCD_WF23_BPDLCD23, 1))
/*@}*/

/*!
 * @name Register LCD_WF23, field BPELCD23[4] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase E
 * - 1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
#define BP_LCD_WF23_BPELCD23 (4U)          /*!< Bit position for LCD_WF23_BPELCD23. */
#define BM_LCD_WF23_BPELCD23 (0x10U)       /*!< Bit mask for LCD_WF23_BPELCD23. */
#define BS_LCD_WF23_BPELCD23 (1U)          /*!< Bit field size in bits for LCD_WF23_BPELCD23. */

/*! @brief Read current value of the LCD_WF23_BPELCD23 field. */
#define BR_LCD_WF23_BPELCD23(x) (BME_UBFX8(HW_LCD_WF23_ADDR(x), BP_LCD_WF23_BPELCD23, BS_LCD_WF23_BPELCD23))

/*! @brief Format value for bitfield LCD_WF23_BPELCD23. */
#define BF_LCD_WF23_BPELCD23(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF23_BPELCD23) & BM_LCD_WF23_BPELCD23)

/*! @brief Set the BPELCD23 field to a new value. */
#define BW_LCD_WF23_BPELCD23(x, v) (BME_BFI8(HW_LCD_WF23_ADDR(x), ((uint8_t)(v) << BP_LCD_WF23_BPELCD23), BP_LCD_WF23_BPELCD23, 1))
/*@}*/

/*!
 * @name Register LCD_WF23, field BPFLCD23[5] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase F
 * - 1 - LCD segment on or LCD backplane active for phase F
 */
/*@{*/
#define BP_LCD_WF23_BPFLCD23 (5U)          /*!< Bit position for LCD_WF23_BPFLCD23. */
#define BM_LCD_WF23_BPFLCD23 (0x20U)       /*!< Bit mask for LCD_WF23_BPFLCD23. */
#define BS_LCD_WF23_BPFLCD23 (1U)          /*!< Bit field size in bits for LCD_WF23_BPFLCD23. */

/*! @brief Read current value of the LCD_WF23_BPFLCD23 field. */
#define BR_LCD_WF23_BPFLCD23(x) (BME_UBFX8(HW_LCD_WF23_ADDR(x), BP_LCD_WF23_BPFLCD23, BS_LCD_WF23_BPFLCD23))

/*! @brief Format value for bitfield LCD_WF23_BPFLCD23. */
#define BF_LCD_WF23_BPFLCD23(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF23_BPFLCD23) & BM_LCD_WF23_BPFLCD23)

/*! @brief Set the BPFLCD23 field to a new value. */
#define BW_LCD_WF23_BPFLCD23(x, v) (BME_BFI8(HW_LCD_WF23_ADDR(x), ((uint8_t)(v) << BP_LCD_WF23_BPFLCD23), BP_LCD_WF23_BPFLCD23, 1))
/*@}*/

/*!
 * @name Register LCD_WF23, field BPGLCD23[6] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase G
 * - 1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
#define BP_LCD_WF23_BPGLCD23 (6U)          /*!< Bit position for LCD_WF23_BPGLCD23. */
#define BM_LCD_WF23_BPGLCD23 (0x40U)       /*!< Bit mask for LCD_WF23_BPGLCD23. */
#define BS_LCD_WF23_BPGLCD23 (1U)          /*!< Bit field size in bits for LCD_WF23_BPGLCD23. */

/*! @brief Read current value of the LCD_WF23_BPGLCD23 field. */
#define BR_LCD_WF23_BPGLCD23(x) (BME_UBFX8(HW_LCD_WF23_ADDR(x), BP_LCD_WF23_BPGLCD23, BS_LCD_WF23_BPGLCD23))

/*! @brief Format value for bitfield LCD_WF23_BPGLCD23. */
#define BF_LCD_WF23_BPGLCD23(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF23_BPGLCD23) & BM_LCD_WF23_BPGLCD23)

/*! @brief Set the BPGLCD23 field to a new value. */
#define BW_LCD_WF23_BPGLCD23(x, v) (BME_BFI8(HW_LCD_WF23_ADDR(x), ((uint8_t)(v) << BP_LCD_WF23_BPGLCD23), BP_LCD_WF23_BPGLCD23, 1))
/*@}*/

/*!
 * @name Register LCD_WF23, field BPHLCD23[7] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase H
 * - 1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
#define BP_LCD_WF23_BPHLCD23 (7U)          /*!< Bit position for LCD_WF23_BPHLCD23. */
#define BM_LCD_WF23_BPHLCD23 (0x80U)       /*!< Bit mask for LCD_WF23_BPHLCD23. */
#define BS_LCD_WF23_BPHLCD23 (1U)          /*!< Bit field size in bits for LCD_WF23_BPHLCD23. */

/*! @brief Read current value of the LCD_WF23_BPHLCD23 field. */
#define BR_LCD_WF23_BPHLCD23(x) (BME_UBFX8(HW_LCD_WF23_ADDR(x), BP_LCD_WF23_BPHLCD23, BS_LCD_WF23_BPHLCD23))

/*! @brief Format value for bitfield LCD_WF23_BPHLCD23. */
#define BF_LCD_WF23_BPHLCD23(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF23_BPHLCD23) & BM_LCD_WF23_BPHLCD23)

/*! @brief Set the BPHLCD23 field to a new value. */
#define BW_LCD_WF23_BPHLCD23(x, v) (BME_BFI8(HW_LCD_WF23_ADDR(x), ((uint8_t)(v) << BP_LCD_WF23_BPHLCD23), BP_LCD_WF23_BPHLCD23, 1))
/*@}*/
/*******************************************************************************
 * HW_LCD_WF24 - LCD Waveform Register 24.
 ******************************************************************************/

/*!
 * @brief HW_LCD_WF24 - LCD Waveform Register 24. (RW)
 *
 * Reset value: 0x00U
 */
typedef union _hw_lcd_wf24
{
    uint8_t U;
    struct _hw_lcd_wf24_bitfields
    {
        uint8_t BPALCD24 : 1;          /*!< [0]  */
        uint8_t BPBLCD24 : 1;          /*!< [1]  */
        uint8_t BPCLCD24 : 1;          /*!< [2]  */
        uint8_t BPDLCD24 : 1;          /*!< [3]  */
        uint8_t BPELCD24 : 1;          /*!< [4]  */
        uint8_t BPFLCD24 : 1;          /*!< [5]  */
        uint8_t BPGLCD24 : 1;          /*!< [6]  */
        uint8_t BPHLCD24 : 1;          /*!< [7]  */
    } B;
} hw_lcd_wf24_t;

/*!
 * @name Constants and macros for entire LCD_WF24 register
 */
/*@{*/
#define HW_LCD_WF24_ADDR(x)      ((x) + 0x38U)

#define HW_LCD_WF24(x)           (*(__IO hw_lcd_wf24_t *) HW_LCD_WF24_ADDR(x))
#define HW_LCD_WF24_RD(x)        (HW_LCD_WF24(x).U)
#define HW_LCD_WF24_WR(x, v)     (HW_LCD_WF24(x).U = (v))
#define HW_LCD_WF24_SET(x, v)    (BME_OR8(HW_LCD_WF24_ADDR(x), (uint8_t)(v)))
#define HW_LCD_WF24_CLR(x, v)    (BME_AND8(HW_LCD_WF24_ADDR(x), (uint8_t)(~(v))))
#define HW_LCD_WF24_TOG(x, v)    (BME_XOR8(HW_LCD_WF24_ADDR(x), (uint8_t)(v)))
/*@}*/

