nevinxu/HM502B2/platform/CMSIS/Include/device/MKL33Z4/MKL33Z4_lcd.h
/*! @brief Set the BPDLCD25 field to a new value. */
#define BW_LCD_WF25_BPDLCD25(x, v) (BME_BFI8(HW_LCD_WF25_ADDR(x), ((uint8_t)(v) << BP_LCD_WF25_BPDLCD25), BP_LCD_WF25_BPDLCD25, 1))
/*@}*/

/*!
 * @name Register LCD_WF25, field BPELCD25[4] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase E
 * - 1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
#define BP_LCD_WF25_BPELCD25 (4U)          /*!< Bit position for LCD_WF25_BPELCD25. */
#define BM_LCD_WF25_BPELCD25 (0x10U)       /*!< Bit mask for LCD_WF25_BPELCD25. */
#define BS_LCD_WF25_BPELCD25 (1U)          /*!< Bit field size in bits for LCD_WF25_BPELCD25. */

/*! @brief Read current value of the LCD_WF25_BPELCD25 field. */
#define BR_LCD_WF25_BPELCD25(x) (BME_UBFX8(HW_LCD_WF25_ADDR(x), BP_LCD_WF25_BPELCD25, BS_LCD_WF25_BPELCD25))

/*! @brief Format value for bitfield LCD_WF25_BPELCD25. */
#define BF_LCD_WF25_BPELCD25(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF25_BPELCD25) & BM_LCD_WF25_BPELCD25)

/*! @brief Set the BPELCD25 field to a new value. */
#define BW_LCD_WF25_BPELCD25(x, v) (BME_BFI8(HW_LCD_WF25_ADDR(x), ((uint8_t)(v) << BP_LCD_WF25_BPELCD25), BP_LCD_WF25_BPELCD25, 1))
/*@}*/

/*!
 * @name Register LCD_WF25, field BPFLCD25[5] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase F
 * - 1 - LCD segment on or LCD backplane active for phase F
 */
/*@{*/
#define BP_LCD_WF25_BPFLCD25 (5U)          /*!< Bit position for LCD_WF25_BPFLCD25. */
#define BM_LCD_WF25_BPFLCD25 (0x20U)       /*!< Bit mask for LCD_WF25_BPFLCD25. */
#define BS_LCD_WF25_BPFLCD25 (1U)          /*!< Bit field size in bits for LCD_WF25_BPFLCD25. */

/*! @brief Read current value of the LCD_WF25_BPFLCD25 field. */
#define BR_LCD_WF25_BPFLCD25(x) (BME_UBFX8(HW_LCD_WF25_ADDR(x), BP_LCD_WF25_BPFLCD25, BS_LCD_WF25_BPFLCD25))

/*! @brief Format value for bitfield LCD_WF25_BPFLCD25. */
#define BF_LCD_WF25_BPFLCD25(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF25_BPFLCD25) & BM_LCD_WF25_BPFLCD25)

/*! @brief Set the BPFLCD25 field to a new value. */
#define BW_LCD_WF25_BPFLCD25(x, v) (BME_BFI8(HW_LCD_WF25_ADDR(x), ((uint8_t)(v) << BP_LCD_WF25_BPFLCD25), BP_LCD_WF25_BPFLCD25, 1))
/*@}*/

/*!
 * @name Register LCD_WF25, field BPGLCD25[6] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase G
 * - 1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
#define BP_LCD_WF25_BPGLCD25 (6U)          /*!< Bit position for LCD_WF25_BPGLCD25. */
#define BM_LCD_WF25_BPGLCD25 (0x40U)       /*!< Bit mask for LCD_WF25_BPGLCD25. */
#define BS_LCD_WF25_BPGLCD25 (1U)          /*!< Bit field size in bits for LCD_WF25_BPGLCD25. */

/*! @brief Read current value of the LCD_WF25_BPGLCD25 field. */
#define BR_LCD_WF25_BPGLCD25(x) (BME_UBFX8(HW_LCD_WF25_ADDR(x), BP_LCD_WF25_BPGLCD25, BS_LCD_WF25_BPGLCD25))

/*! @brief Format value for bitfield LCD_WF25_BPGLCD25. */
#define BF_LCD_WF25_BPGLCD25(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF25_BPGLCD25) & BM_LCD_WF25_BPGLCD25)

/*! @brief Set the BPGLCD25 field to a new value. */
#define BW_LCD_WF25_BPGLCD25(x, v) (BME_BFI8(HW_LCD_WF25_ADDR(x), ((uint8_t)(v) << BP_LCD_WF25_BPGLCD25), BP_LCD_WF25_BPGLCD25, 1))
/*@}*/

/*!
 * @name Register LCD_WF25, field BPHLCD25[7] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase H
 * - 1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
#define BP_LCD_WF25_BPHLCD25 (7U)          /*!< Bit position for LCD_WF25_BPHLCD25. */
#define BM_LCD_WF25_BPHLCD25 (0x80U)       /*!< Bit mask for LCD_WF25_BPHLCD25. */
#define BS_LCD_WF25_BPHLCD25 (1U)          /*!< Bit field size in bits for LCD_WF25_BPHLCD25. */

/*! @brief Read current value of the LCD_WF25_BPHLCD25 field. */
#define BR_LCD_WF25_BPHLCD25(x) (BME_UBFX8(HW_LCD_WF25_ADDR(x), BP_LCD_WF25_BPHLCD25, BS_LCD_WF25_BPHLCD25))

/*! @brief Format value for bitfield LCD_WF25_BPHLCD25. */
#define BF_LCD_WF25_BPHLCD25(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF25_BPHLCD25) & BM_LCD_WF25_BPHLCD25)

/*! @brief Set the BPHLCD25 field to a new value. */
#define BW_LCD_WF25_BPHLCD25(x, v) (BME_BFI8(HW_LCD_WF25_ADDR(x), ((uint8_t)(v) << BP_LCD_WF25_BPHLCD25), BP_LCD_WF25_BPHLCD25, 1))
/*@}*/
/*******************************************************************************
 * HW_LCD_WF26 - LCD Waveform Register 26.
 ******************************************************************************/

/*!
 * @brief HW_LCD_WF26 - LCD Waveform Register 26. (RW)
 *
 * Reset value: 0x00U
 */
typedef union _hw_lcd_wf26
{
    uint8_t U;
    struct _hw_lcd_wf26_bitfields
    {
        uint8_t BPALCD26 : 1;          /*!< [0]  */
        uint8_t BPBLCD26 : 1;          /*!< [1]  */
        uint8_t BPCLCD26 : 1;          /*!< [2]  */
        uint8_t BPDLCD26 : 1;          /*!< [3]  */
        uint8_t BPELCD26 : 1;          /*!< [4]  */
        uint8_t BPFLCD26 : 1;          /*!< [5]  */
        uint8_t BPGLCD26 : 1;          /*!< [6]  */
        uint8_t BPHLCD26 : 1;          /*!< [7]  */
    } B;
} hw_lcd_wf26_t;

/*!
 * @name Constants and macros for entire LCD_WF26 register
 */
/*@{*/
#define HW_LCD_WF26_ADDR(x)      ((x) + 0x3AU)

#define HW_LCD_WF26(x)           (*(__IO hw_lcd_wf26_t *) HW_LCD_WF26_ADDR(x))
#define HW_LCD_WF26_RD(x)        (HW_LCD_WF26(x).U)
#define HW_LCD_WF26_WR(x, v)     (HW_LCD_WF26(x).U = (v))
#define HW_LCD_WF26_SET(x, v)    (BME_OR8(HW_LCD_WF26_ADDR(x), (uint8_t)(v)))
#define HW_LCD_WF26_CLR(x, v)    (BME_AND8(HW_LCD_WF26_ADDR(x), (uint8_t)(~(v))))
#define HW_LCD_WF26_TOG(x, v)    (BME_XOR8(HW_LCD_WF26_ADDR(x), (uint8_t)(v)))
/*@}*/

/*
 * Constants & macros for individual LCD_WF26 bitfields
 */

/*!
 * @name Register LCD_WF26, field BPALCD26[0] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase A
 * - 1 - LCD segment on or LCD backplane active for phase A
 */
/*@{*/
#define BP_LCD_WF26_BPALCD26 (0U)          /*!< Bit position for LCD_WF26_BPALCD26. */
#define BM_LCD_WF26_BPALCD26 (0x01U)       /*!< Bit mask for LCD_WF26_BPALCD26. */
#define BS_LCD_WF26_BPALCD26 (1U)          /*!< Bit field size in bits for LCD_WF26_BPALCD26. */

/*! @brief Read current value of the LCD_WF26_BPALCD26 field. */
#define BR_LCD_WF26_BPALCD26(x) (BME_UBFX8(HW_LCD_WF26_ADDR(x), BP_LCD_WF26_BPALCD26, BS_LCD_WF26_BPALCD26))

/*! @brief Format value for bitfield LCD_WF26_BPALCD26. */
#define BF_LCD_WF26_BPALCD26(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF26_BPALCD26) & BM_LCD_WF26_BPALCD26)

/*! @brief Set the BPALCD26 field to a new value. */
#define BW_LCD_WF26_BPALCD26(x, v) (BME_BFI8(HW_LCD_WF26_ADDR(x), ((uint8_t)(v) << BP_LCD_WF26_BPALCD26), BP_LCD_WF26_BPALCD26, 1))
/*@}*/

/*!
 * @name Register LCD_WF26, field BPBLCD26[1] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase B
 * - 1 - LCD segment on or LCD backplane active for phase B
 */
/*@{*/
#define BP_LCD_WF26_BPBLCD26 (1U)          /*!< Bit position for LCD_WF26_BPBLCD26. */
#define BM_LCD_WF26_BPBLCD26 (0x02U)       /*!< Bit mask for LCD_WF26_BPBLCD26. */
#define BS_LCD_WF26_BPBLCD26 (1U)          /*!< Bit field size in bits for LCD_WF26_BPBLCD26. */

