nevinxu/HM502B2/platform/CMSIS/Include/device/MKL33Z4/MKL33Z4_lcd.h
/*! @brief Read current value of the LCD_WF26_BPBLCD26 field. */
#define BR_LCD_WF26_BPBLCD26(x) (BME_UBFX8(HW_LCD_WF26_ADDR(x), BP_LCD_WF26_BPBLCD26, BS_LCD_WF26_BPBLCD26))

/*! @brief Format value for bitfield LCD_WF26_BPBLCD26. */
#define BF_LCD_WF26_BPBLCD26(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF26_BPBLCD26) & BM_LCD_WF26_BPBLCD26)

/*! @brief Set the BPBLCD26 field to a new value. */
#define BW_LCD_WF26_BPBLCD26(x, v) (BME_BFI8(HW_LCD_WF26_ADDR(x), ((uint8_t)(v) << BP_LCD_WF26_BPBLCD26), BP_LCD_WF26_BPBLCD26, 1))
/*@}*/

/*!
 * @name Register LCD_WF26, field BPCLCD26[2] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase C
 * - 1 - LCD segment on or LCD backplane active for phase C
 */
/*@{*/
#define BP_LCD_WF26_BPCLCD26 (2U)          /*!< Bit position for LCD_WF26_BPCLCD26. */
#define BM_LCD_WF26_BPCLCD26 (0x04U)       /*!< Bit mask for LCD_WF26_BPCLCD26. */
#define BS_LCD_WF26_BPCLCD26 (1U)          /*!< Bit field size in bits for LCD_WF26_BPCLCD26. */

/*! @brief Read current value of the LCD_WF26_BPCLCD26 field. */
#define BR_LCD_WF26_BPCLCD26(x) (BME_UBFX8(HW_LCD_WF26_ADDR(x), BP_LCD_WF26_BPCLCD26, BS_LCD_WF26_BPCLCD26))

/*! @brief Format value for bitfield LCD_WF26_BPCLCD26. */
#define BF_LCD_WF26_BPCLCD26(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF26_BPCLCD26) & BM_LCD_WF26_BPCLCD26)

/*! @brief Set the BPCLCD26 field to a new value. */
#define BW_LCD_WF26_BPCLCD26(x, v) (BME_BFI8(HW_LCD_WF26_ADDR(x), ((uint8_t)(v) << BP_LCD_WF26_BPCLCD26), BP_LCD_WF26_BPCLCD26, 1))
/*@}*/

/*!
 * @name Register LCD_WF26, field BPDLCD26[3] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase D
 * - 1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
#define BP_LCD_WF26_BPDLCD26 (3U)          /*!< Bit position for LCD_WF26_BPDLCD26. */
#define BM_LCD_WF26_BPDLCD26 (0x08U)       /*!< Bit mask for LCD_WF26_BPDLCD26. */
#define BS_LCD_WF26_BPDLCD26 (1U)          /*!< Bit field size in bits for LCD_WF26_BPDLCD26. */

/*! @brief Read current value of the LCD_WF26_BPDLCD26 field. */
#define BR_LCD_WF26_BPDLCD26(x) (BME_UBFX8(HW_LCD_WF26_ADDR(x), BP_LCD_WF26_BPDLCD26, BS_LCD_WF26_BPDLCD26))

/*! @brief Format value for bitfield LCD_WF26_BPDLCD26. */
#define BF_LCD_WF26_BPDLCD26(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF26_BPDLCD26) & BM_LCD_WF26_BPDLCD26)

/*! @brief Set the BPDLCD26 field to a new value. */
#define BW_LCD_WF26_BPDLCD26(x, v) (BME_BFI8(HW_LCD_WF26_ADDR(x), ((uint8_t)(v) << BP_LCD_WF26_BPDLCD26), BP_LCD_WF26_BPDLCD26, 1))
/*@}*/

/*!
 * @name Register LCD_WF26, field BPELCD26[4] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase E
 * - 1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
#define BP_LCD_WF26_BPELCD26 (4U)          /*!< Bit position for LCD_WF26_BPELCD26. */
#define BM_LCD_WF26_BPELCD26 (0x10U)       /*!< Bit mask for LCD_WF26_BPELCD26. */
#define BS_LCD_WF26_BPELCD26 (1U)          /*!< Bit field size in bits for LCD_WF26_BPELCD26. */

/*! @brief Read current value of the LCD_WF26_BPELCD26 field. */
#define BR_LCD_WF26_BPELCD26(x) (BME_UBFX8(HW_LCD_WF26_ADDR(x), BP_LCD_WF26_BPELCD26, BS_LCD_WF26_BPELCD26))

/*! @brief Format value for bitfield LCD_WF26_BPELCD26. */
#define BF_LCD_WF26_BPELCD26(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF26_BPELCD26) & BM_LCD_WF26_BPELCD26)

/*! @brief Set the BPELCD26 field to a new value. */
#define BW_LCD_WF26_BPELCD26(x, v) (BME_BFI8(HW_LCD_WF26_ADDR(x), ((uint8_t)(v) << BP_LCD_WF26_BPELCD26), BP_LCD_WF26_BPELCD26, 1))
/*@}*/

/*!
 * @name Register LCD_WF26, field BPFLCD26[5] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase F
 * - 1 - LCD segment on or LCD backplane active for phase F
 */
/*@{*/
#define BP_LCD_WF26_BPFLCD26 (5U)          /*!< Bit position for LCD_WF26_BPFLCD26. */
#define BM_LCD_WF26_BPFLCD26 (0x20U)       /*!< Bit mask for LCD_WF26_BPFLCD26. */
#define BS_LCD_WF26_BPFLCD26 (1U)          /*!< Bit field size in bits for LCD_WF26_BPFLCD26. */

/*! @brief Read current value of the LCD_WF26_BPFLCD26 field. */
#define BR_LCD_WF26_BPFLCD26(x) (BME_UBFX8(HW_LCD_WF26_ADDR(x), BP_LCD_WF26_BPFLCD26, BS_LCD_WF26_BPFLCD26))

/*! @brief Format value for bitfield LCD_WF26_BPFLCD26. */
#define BF_LCD_WF26_BPFLCD26(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF26_BPFLCD26) & BM_LCD_WF26_BPFLCD26)

/*! @brief Set the BPFLCD26 field to a new value. */
#define BW_LCD_WF26_BPFLCD26(x, v) (BME_BFI8(HW_LCD_WF26_ADDR(x), ((uint8_t)(v) << BP_LCD_WF26_BPFLCD26), BP_LCD_WF26_BPFLCD26, 1))
/*@}*/

/*!
 * @name Register LCD_WF26, field BPGLCD26[6] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase G
 * - 1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
#define BP_LCD_WF26_BPGLCD26 (6U)          /*!< Bit position for LCD_WF26_BPGLCD26. */
#define BM_LCD_WF26_BPGLCD26 (0x40U)       /*!< Bit mask for LCD_WF26_BPGLCD26. */
#define BS_LCD_WF26_BPGLCD26 (1U)          /*!< Bit field size in bits for LCD_WF26_BPGLCD26. */

/*! @brief Read current value of the LCD_WF26_BPGLCD26 field. */
#define BR_LCD_WF26_BPGLCD26(x) (BME_UBFX8(HW_LCD_WF26_ADDR(x), BP_LCD_WF26_BPGLCD26, BS_LCD_WF26_BPGLCD26))

/*! @brief Format value for bitfield LCD_WF26_BPGLCD26. */
#define BF_LCD_WF26_BPGLCD26(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF26_BPGLCD26) & BM_LCD_WF26_BPGLCD26)

/*! @brief Set the BPGLCD26 field to a new value. */
#define BW_LCD_WF26_BPGLCD26(x, v) (BME_BFI8(HW_LCD_WF26_ADDR(x), ((uint8_t)(v) << BP_LCD_WF26_BPGLCD26), BP_LCD_WF26_BPGLCD26, 1))
/*@}*/

/*!
 * @name Register LCD_WF26, field BPHLCD26[7] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase H
 * - 1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
#define BP_LCD_WF26_BPHLCD26 (7U)          /*!< Bit position for LCD_WF26_BPHLCD26. */
#define BM_LCD_WF26_BPHLCD26 (0x80U)       /*!< Bit mask for LCD_WF26_BPHLCD26. */
#define BS_LCD_WF26_BPHLCD26 (1U)          /*!< Bit field size in bits for LCD_WF26_BPHLCD26. */

