nevinxu/HM502B2/platform/CMSIS/Include/device/MKL33Z4/MKL33Z4_lcd.h
/*! @brief Read current value of the LCD_WF27_BPGLCD27 field. */
#define BR_LCD_WF27_BPGLCD27(x) (BME_UBFX8(HW_LCD_WF27_ADDR(x), BP_LCD_WF27_BPGLCD27, BS_LCD_WF27_BPGLCD27))

/*! @brief Format value for bitfield LCD_WF27_BPGLCD27. */
#define BF_LCD_WF27_BPGLCD27(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF27_BPGLCD27) & BM_LCD_WF27_BPGLCD27)

/*! @brief Set the BPGLCD27 field to a new value. */
#define BW_LCD_WF27_BPGLCD27(x, v) (BME_BFI8(HW_LCD_WF27_ADDR(x), ((uint8_t)(v) << BP_LCD_WF27_BPGLCD27), BP_LCD_WF27_BPGLCD27, 1))
/*@}*/

/*!
 * @name Register LCD_WF27, field BPHLCD27[7] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase H
 * - 1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
#define BP_LCD_WF27_BPHLCD27 (7U)          /*!< Bit position for LCD_WF27_BPHLCD27. */
#define BM_LCD_WF27_BPHLCD27 (0x80U)       /*!< Bit mask for LCD_WF27_BPHLCD27. */
#define BS_LCD_WF27_BPHLCD27 (1U)          /*!< Bit field size in bits for LCD_WF27_BPHLCD27. */

/*! @brief Read current value of the LCD_WF27_BPHLCD27 field. */
#define BR_LCD_WF27_BPHLCD27(x) (BME_UBFX8(HW_LCD_WF27_ADDR(x), BP_LCD_WF27_BPHLCD27, BS_LCD_WF27_BPHLCD27))

/*! @brief Format value for bitfield LCD_WF27_BPHLCD27. */
#define BF_LCD_WF27_BPHLCD27(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF27_BPHLCD27) & BM_LCD_WF27_BPHLCD27)

/*! @brief Set the BPHLCD27 field to a new value. */
#define BW_LCD_WF27_BPHLCD27(x, v) (BME_BFI8(HW_LCD_WF27_ADDR(x), ((uint8_t)(v) << BP_LCD_WF27_BPHLCD27), BP_LCD_WF27_BPHLCD27, 1))
/*@}*/
/*******************************************************************************
 * HW_LCD_WF28 - LCD Waveform Register 28.
 ******************************************************************************/

/*!
 * @brief HW_LCD_WF28 - LCD Waveform Register 28. (RW)
 *
 * Reset value: 0x00U
 */
typedef union _hw_lcd_wf28
{
    uint8_t U;
    struct _hw_lcd_wf28_bitfields
    {
        uint8_t BPALCD28 : 1;          /*!< [0]  */
        uint8_t BPBLCD28 : 1;          /*!< [1]  */
        uint8_t BPCLCD28 : 1;          /*!< [2]  */
        uint8_t BPDLCD28 : 1;          /*!< [3]  */
        uint8_t BPELCD28 : 1;          /*!< [4]  */
        uint8_t BPFLCD28 : 1;          /*!< [5]  */
        uint8_t BPGLCD28 : 1;          /*!< [6]  */
        uint8_t BPHLCD28 : 1;          /*!< [7]  */
    } B;
} hw_lcd_wf28_t;

/*!
 * @name Constants and macros for entire LCD_WF28 register
 */
/*@{*/
#define HW_LCD_WF28_ADDR(x)      ((x) + 0x3CU)

#define HW_LCD_WF28(x)           (*(__IO hw_lcd_wf28_t *) HW_LCD_WF28_ADDR(x))
#define HW_LCD_WF28_RD(x)        (HW_LCD_WF28(x).U)
#define HW_LCD_WF28_WR(x, v)     (HW_LCD_WF28(x).U = (v))
#define HW_LCD_WF28_SET(x, v)    (BME_OR8(HW_LCD_WF28_ADDR(x), (uint8_t)(v)))
#define HW_LCD_WF28_CLR(x, v)    (BME_AND8(HW_LCD_WF28_ADDR(x), (uint8_t)(~(v))))
#define HW_LCD_WF28_TOG(x, v)    (BME_XOR8(HW_LCD_WF28_ADDR(x), (uint8_t)(v)))
/*@}*/

/*
 * Constants & macros for individual LCD_WF28 bitfields
 */

/*!
 * @name Register LCD_WF28, field BPALCD28[0] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase A
 * - 1 - LCD segment on or LCD backplane active for phase A
 */
/*@{*/
#define BP_LCD_WF28_BPALCD28 (0U)          /*!< Bit position for LCD_WF28_BPALCD28. */
#define BM_LCD_WF28_BPALCD28 (0x01U)       /*!< Bit mask for LCD_WF28_BPALCD28. */
#define BS_LCD_WF28_BPALCD28 (1U)          /*!< Bit field size in bits for LCD_WF28_BPALCD28. */

/*! @brief Read current value of the LCD_WF28_BPALCD28 field. */
#define BR_LCD_WF28_BPALCD28(x) (BME_UBFX8(HW_LCD_WF28_ADDR(x), BP_LCD_WF28_BPALCD28, BS_LCD_WF28_BPALCD28))

/*! @brief Format value for bitfield LCD_WF28_BPALCD28. */
#define BF_LCD_WF28_BPALCD28(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF28_BPALCD28) & BM_LCD_WF28_BPALCD28)

/*! @brief Set the BPALCD28 field to a new value. */
#define BW_LCD_WF28_BPALCD28(x, v) (BME_BFI8(HW_LCD_WF28_ADDR(x), ((uint8_t)(v) << BP_LCD_WF28_BPALCD28), BP_LCD_WF28_BPALCD28, 1))
/*@}*/

/*!
 * @name Register LCD_WF28, field BPBLCD28[1] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase B
 * - 1 - LCD segment on or LCD backplane active for phase B
 */
/*@{*/
#define BP_LCD_WF28_BPBLCD28 (1U)          /*!< Bit position for LCD_WF28_BPBLCD28. */
#define BM_LCD_WF28_BPBLCD28 (0x02U)       /*!< Bit mask for LCD_WF28_BPBLCD28. */
#define BS_LCD_WF28_BPBLCD28 (1U)          /*!< Bit field size in bits for LCD_WF28_BPBLCD28. */

/*! @brief Read current value of the LCD_WF28_BPBLCD28 field. */
#define BR_LCD_WF28_BPBLCD28(x) (BME_UBFX8(HW_LCD_WF28_ADDR(x), BP_LCD_WF28_BPBLCD28, BS_LCD_WF28_BPBLCD28))

/*! @brief Format value for bitfield LCD_WF28_BPBLCD28. */
#define BF_LCD_WF28_BPBLCD28(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF28_BPBLCD28) & BM_LCD_WF28_BPBLCD28)

/*! @brief Set the BPBLCD28 field to a new value. */
#define BW_LCD_WF28_BPBLCD28(x, v) (BME_BFI8(HW_LCD_WF28_ADDR(x), ((uint8_t)(v) << BP_LCD_WF28_BPBLCD28), BP_LCD_WF28_BPBLCD28, 1))
/*@}*/

/*!
 * @name Register LCD_WF28, field BPCLCD28[2] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase C
 * - 1 - LCD segment on or LCD backplane active for phase C
 */
/*@{*/
#define BP_LCD_WF28_BPCLCD28 (2U)          /*!< Bit position for LCD_WF28_BPCLCD28. */
#define BM_LCD_WF28_BPCLCD28 (0x04U)       /*!< Bit mask for LCD_WF28_BPCLCD28. */
#define BS_LCD_WF28_BPCLCD28 (1U)          /*!< Bit field size in bits for LCD_WF28_BPCLCD28. */

/*! @brief Read current value of the LCD_WF28_BPCLCD28 field. */
#define BR_LCD_WF28_BPCLCD28(x) (BME_UBFX8(HW_LCD_WF28_ADDR(x), BP_LCD_WF28_BPCLCD28, BS_LCD_WF28_BPCLCD28))

/*! @brief Format value for bitfield LCD_WF28_BPCLCD28. */
#define BF_LCD_WF28_BPCLCD28(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF28_BPCLCD28) & BM_LCD_WF28_BPCLCD28)

/*! @brief Set the BPCLCD28 field to a new value. */
#define BW_LCD_WF28_BPCLCD28(x, v) (BME_BFI8(HW_LCD_WF28_ADDR(x), ((uint8_t)(v) << BP_LCD_WF28_BPCLCD28), BP_LCD_WF28_BPCLCD28, 1))
/*@}*/

/*!
 * @name Register LCD_WF28, field BPDLCD28[3] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase D
 * - 1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
#define BP_LCD_WF28_BPDLCD28 (3U)          /*!< Bit position for LCD_WF28_BPDLCD28. */
#define BM_LCD_WF28_BPDLCD28 (0x08U)       /*!< Bit mask for LCD_WF28_BPDLCD28. */
#define BS_LCD_WF28_BPDLCD28 (1U)          /*!< Bit field size in bits for LCD_WF28_BPDLCD28. */

/*! @brief Read current value of the LCD_WF28_BPDLCD28 field. */
#define BR_LCD_WF28_BPDLCD28(x) (BME_UBFX8(HW_LCD_WF28_ADDR(x), BP_LCD_WF28_BPDLCD28, BS_LCD_WF28_BPDLCD28))

