nevinxu/HM502B2/platform/CMSIS/Include/device/MKL33Z4/MKL33Z4_lcd.h
/*! @brief Read current value of the LCD_WF30_BPFLCD30 field. */
#define BR_LCD_WF30_BPFLCD30(x) (BME_UBFX8(HW_LCD_WF30_ADDR(x), BP_LCD_WF30_BPFLCD30, BS_LCD_WF30_BPFLCD30))

/*! @brief Format value for bitfield LCD_WF30_BPFLCD30. */
#define BF_LCD_WF30_BPFLCD30(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF30_BPFLCD30) & BM_LCD_WF30_BPFLCD30)

/*! @brief Set the BPFLCD30 field to a new value. */
#define BW_LCD_WF30_BPFLCD30(x, v) (BME_BFI8(HW_LCD_WF30_ADDR(x), ((uint8_t)(v) << BP_LCD_WF30_BPFLCD30), BP_LCD_WF30_BPFLCD30, 1))
/*@}*/

/*!
 * @name Register LCD_WF30, field BPGLCD30[6] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase G
 * - 1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
#define BP_LCD_WF30_BPGLCD30 (6U)          /*!< Bit position for LCD_WF30_BPGLCD30. */
#define BM_LCD_WF30_BPGLCD30 (0x40U)       /*!< Bit mask for LCD_WF30_BPGLCD30. */
#define BS_LCD_WF30_BPGLCD30 (1U)          /*!< Bit field size in bits for LCD_WF30_BPGLCD30. */

/*! @brief Read current value of the LCD_WF30_BPGLCD30 field. */
#define BR_LCD_WF30_BPGLCD30(x) (BME_UBFX8(HW_LCD_WF30_ADDR(x), BP_LCD_WF30_BPGLCD30, BS_LCD_WF30_BPGLCD30))

/*! @brief Format value for bitfield LCD_WF30_BPGLCD30. */
#define BF_LCD_WF30_BPGLCD30(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF30_BPGLCD30) & BM_LCD_WF30_BPGLCD30)

/*! @brief Set the BPGLCD30 field to a new value. */
#define BW_LCD_WF30_BPGLCD30(x, v) (BME_BFI8(HW_LCD_WF30_ADDR(x), ((uint8_t)(v) << BP_LCD_WF30_BPGLCD30), BP_LCD_WF30_BPGLCD30, 1))
/*@}*/

/*!
 * @name Register LCD_WF30, field BPHLCD30[7] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase H
 * - 1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
#define BP_LCD_WF30_BPHLCD30 (7U)          /*!< Bit position for LCD_WF30_BPHLCD30. */
#define BM_LCD_WF30_BPHLCD30 (0x80U)       /*!< Bit mask for LCD_WF30_BPHLCD30. */
#define BS_LCD_WF30_BPHLCD30 (1U)          /*!< Bit field size in bits for LCD_WF30_BPHLCD30. */

/*! @brief Read current value of the LCD_WF30_BPHLCD30 field. */
#define BR_LCD_WF30_BPHLCD30(x) (BME_UBFX8(HW_LCD_WF30_ADDR(x), BP_LCD_WF30_BPHLCD30, BS_LCD_WF30_BPHLCD30))

/*! @brief Format value for bitfield LCD_WF30_BPHLCD30. */
#define BF_LCD_WF30_BPHLCD30(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF30_BPHLCD30) & BM_LCD_WF30_BPHLCD30)

/*! @brief Set the BPHLCD30 field to a new value. */
#define BW_LCD_WF30_BPHLCD30(x, v) (BME_BFI8(HW_LCD_WF30_ADDR(x), ((uint8_t)(v) << BP_LCD_WF30_BPHLCD30), BP_LCD_WF30_BPHLCD30, 1))
/*@}*/
/*******************************************************************************
 * HW_LCD_WF31 - LCD Waveform Register 31.
 ******************************************************************************/

/*!
 * @brief HW_LCD_WF31 - LCD Waveform Register 31. (RW)
 *
 * Reset value: 0x00U
 */
typedef union _hw_lcd_wf31
{
    uint8_t U;
    struct _hw_lcd_wf31_bitfields
    {
        uint8_t BPALCD31 : 1;          /*!< [0]  */
        uint8_t BPBLCD31 : 1;          /*!< [1]  */
        uint8_t BPCLCD31 : 1;          /*!< [2]  */
        uint8_t BPDLCD31 : 1;          /*!< [3]  */
        uint8_t BPELCD31 : 1;          /*!< [4]  */
        uint8_t BPFLCD31 : 1;          /*!< [5]  */
        uint8_t BPGLCD31 : 1;          /*!< [6]  */
        uint8_t BPHLCD31 : 1;          /*!< [7]  */
    } B;
} hw_lcd_wf31_t;

/*!
 * @name Constants and macros for entire LCD_WF31 register
 */
/*@{*/
#define HW_LCD_WF31_ADDR(x)      ((x) + 0x3FU)

#define HW_LCD_WF31(x)           (*(__IO hw_lcd_wf31_t *) HW_LCD_WF31_ADDR(x))
#define HW_LCD_WF31_RD(x)        (HW_LCD_WF31(x).U)
#define HW_LCD_WF31_WR(x, v)     (HW_LCD_WF31(x).U = (v))
#define HW_LCD_WF31_SET(x, v)    (BME_OR8(HW_LCD_WF31_ADDR(x), (uint8_t)(v)))
#define HW_LCD_WF31_CLR(x, v)    (BME_AND8(HW_LCD_WF31_ADDR(x), (uint8_t)(~(v))))
#define HW_LCD_WF31_TOG(x, v)    (BME_XOR8(HW_LCD_WF31_ADDR(x), (uint8_t)(v)))
/*@}*/

/*
 * Constants & macros for individual LCD_WF31 bitfields
 */

/*!
 * @name Register LCD_WF31, field BPALCD31[0] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase A
 * - 1 - LCD segment on or LCD backplane active for phase A
 */
/*@{*/
#define BP_LCD_WF31_BPALCD31 (0U)          /*!< Bit position for LCD_WF31_BPALCD31. */
#define BM_LCD_WF31_BPALCD31 (0x01U)       /*!< Bit mask for LCD_WF31_BPALCD31. */
#define BS_LCD_WF31_BPALCD31 (1U)          /*!< Bit field size in bits for LCD_WF31_BPALCD31. */

/*! @brief Read current value of the LCD_WF31_BPALCD31 field. */
#define BR_LCD_WF31_BPALCD31(x) (BME_UBFX8(HW_LCD_WF31_ADDR(x), BP_LCD_WF31_BPALCD31, BS_LCD_WF31_BPALCD31))

/*! @brief Format value for bitfield LCD_WF31_BPALCD31. */
#define BF_LCD_WF31_BPALCD31(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF31_BPALCD31) & BM_LCD_WF31_BPALCD31)

/*! @brief Set the BPALCD31 field to a new value. */
#define BW_LCD_WF31_BPALCD31(x, v) (BME_BFI8(HW_LCD_WF31_ADDR(x), ((uint8_t)(v) << BP_LCD_WF31_BPALCD31), BP_LCD_WF31_BPALCD31, 1))
/*@}*/

/*!
 * @name Register LCD_WF31, field BPBLCD31[1] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase B
 * - 1 - LCD segment on or LCD backplane active for phase B
 */
/*@{*/
#define BP_LCD_WF31_BPBLCD31 (1U)          /*!< Bit position for LCD_WF31_BPBLCD31. */
#define BM_LCD_WF31_BPBLCD31 (0x02U)       /*!< Bit mask for LCD_WF31_BPBLCD31. */
#define BS_LCD_WF31_BPBLCD31 (1U)          /*!< Bit field size in bits for LCD_WF31_BPBLCD31. */

/*! @brief Read current value of the LCD_WF31_BPBLCD31 field. */
#define BR_LCD_WF31_BPBLCD31(x) (BME_UBFX8(HW_LCD_WF31_ADDR(x), BP_LCD_WF31_BPBLCD31, BS_LCD_WF31_BPBLCD31))

/*! @brief Format value for bitfield LCD_WF31_BPBLCD31. */
#define BF_LCD_WF31_BPBLCD31(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF31_BPBLCD31) & BM_LCD_WF31_BPBLCD31)

/*! @brief Set the BPBLCD31 field to a new value. */
#define BW_LCD_WF31_BPBLCD31(x, v) (BME_BFI8(HW_LCD_WF31_ADDR(x), ((uint8_t)(v) << BP_LCD_WF31_BPBLCD31), BP_LCD_WF31_BPBLCD31, 1))
/*@}*/

/*!
 * @name Register LCD_WF31, field BPCLCD31[2] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase C
 * - 1 - LCD segment on or LCD backplane active for phase C
 */
/*@{*/
#define BP_LCD_WF31_BPCLCD31 (2U)          /*!< Bit position for LCD_WF31_BPCLCD31. */
#define BM_LCD_WF31_BPCLCD31 (0x04U)       /*!< Bit mask for LCD_WF31_BPCLCD31. */
#define BS_LCD_WF31_BPCLCD31 (1U)          /*!< Bit field size in bits for LCD_WF31_BPCLCD31. */

