nevinxu/HM502B2/platform/CMSIS/Include/device/MKL33Z4/MKL33Z4_lcd.h
/*! @brief Set the BPCLCD46 field to a new value. */
#define BW_LCD_WF46_BPCLCD46(x, v) (BME_BFI8(HW_LCD_WF46_ADDR(x), ((uint8_t)(v) << BP_LCD_WF46_BPCLCD46), BP_LCD_WF46_BPCLCD46, 1))
/*@}*/

/*!
 * @name Register LCD_WF46, field BPDLCD46[3] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase D
 * - 1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
#define BP_LCD_WF46_BPDLCD46 (3U)          /*!< Bit position for LCD_WF46_BPDLCD46. */
#define BM_LCD_WF46_BPDLCD46 (0x08U)       /*!< Bit mask for LCD_WF46_BPDLCD46. */
#define BS_LCD_WF46_BPDLCD46 (1U)          /*!< Bit field size in bits for LCD_WF46_BPDLCD46. */

/*! @brief Read current value of the LCD_WF46_BPDLCD46 field. */
#define BR_LCD_WF46_BPDLCD46(x) (BME_UBFX8(HW_LCD_WF46_ADDR(x), BP_LCD_WF46_BPDLCD46, BS_LCD_WF46_BPDLCD46))

/*! @brief Format value for bitfield LCD_WF46_BPDLCD46. */
#define BF_LCD_WF46_BPDLCD46(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF46_BPDLCD46) & BM_LCD_WF46_BPDLCD46)

/*! @brief Set the BPDLCD46 field to a new value. */
#define BW_LCD_WF46_BPDLCD46(x, v) (BME_BFI8(HW_LCD_WF46_ADDR(x), ((uint8_t)(v) << BP_LCD_WF46_BPDLCD46), BP_LCD_WF46_BPDLCD46, 1))
/*@}*/

/*!
 * @name Register LCD_WF46, field BPELCD46[4] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase E
 * - 1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
#define BP_LCD_WF46_BPELCD46 (4U)          /*!< Bit position for LCD_WF46_BPELCD46. */
#define BM_LCD_WF46_BPELCD46 (0x10U)       /*!< Bit mask for LCD_WF46_BPELCD46. */
#define BS_LCD_WF46_BPELCD46 (1U)          /*!< Bit field size in bits for LCD_WF46_BPELCD46. */

/*! @brief Read current value of the LCD_WF46_BPELCD46 field. */
#define BR_LCD_WF46_BPELCD46(x) (BME_UBFX8(HW_LCD_WF46_ADDR(x), BP_LCD_WF46_BPELCD46, BS_LCD_WF46_BPELCD46))

/*! @brief Format value for bitfield LCD_WF46_BPELCD46. */
#define BF_LCD_WF46_BPELCD46(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF46_BPELCD46) & BM_LCD_WF46_BPELCD46)

/*! @brief Set the BPELCD46 field to a new value. */
#define BW_LCD_WF46_BPELCD46(x, v) (BME_BFI8(HW_LCD_WF46_ADDR(x), ((uint8_t)(v) << BP_LCD_WF46_BPELCD46), BP_LCD_WF46_BPELCD46, 1))
/*@}*/

/*!
 * @name Register LCD_WF46, field BPFLCD46[5] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase F
 * - 1 - LCD segment on or LCD backplane active for phase F
 */
/*@{*/
#define BP_LCD_WF46_BPFLCD46 (5U)          /*!< Bit position for LCD_WF46_BPFLCD46. */
#define BM_LCD_WF46_BPFLCD46 (0x20U)       /*!< Bit mask for LCD_WF46_BPFLCD46. */
#define BS_LCD_WF46_BPFLCD46 (1U)          /*!< Bit field size in bits for LCD_WF46_BPFLCD46. */

/*! @brief Read current value of the LCD_WF46_BPFLCD46 field. */
#define BR_LCD_WF46_BPFLCD46(x) (BME_UBFX8(HW_LCD_WF46_ADDR(x), BP_LCD_WF46_BPFLCD46, BS_LCD_WF46_BPFLCD46))

/*! @brief Format value for bitfield LCD_WF46_BPFLCD46. */
#define BF_LCD_WF46_BPFLCD46(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF46_BPFLCD46) & BM_LCD_WF46_BPFLCD46)

/*! @brief Set the BPFLCD46 field to a new value. */
#define BW_LCD_WF46_BPFLCD46(x, v) (BME_BFI8(HW_LCD_WF46_ADDR(x), ((uint8_t)(v) << BP_LCD_WF46_BPFLCD46), BP_LCD_WF46_BPFLCD46, 1))
/*@}*/

/*!
 * @name Register LCD_WF46, field BPGLCD46[6] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase G
 * - 1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
#define BP_LCD_WF46_BPGLCD46 (6U)          /*!< Bit position for LCD_WF46_BPGLCD46. */
#define BM_LCD_WF46_BPGLCD46 (0x40U)       /*!< Bit mask for LCD_WF46_BPGLCD46. */
#define BS_LCD_WF46_BPGLCD46 (1U)          /*!< Bit field size in bits for LCD_WF46_BPGLCD46. */

/*! @brief Read current value of the LCD_WF46_BPGLCD46 field. */
#define BR_LCD_WF46_BPGLCD46(x) (BME_UBFX8(HW_LCD_WF46_ADDR(x), BP_LCD_WF46_BPGLCD46, BS_LCD_WF46_BPGLCD46))

/*! @brief Format value for bitfield LCD_WF46_BPGLCD46. */
#define BF_LCD_WF46_BPGLCD46(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF46_BPGLCD46) & BM_LCD_WF46_BPGLCD46)

/*! @brief Set the BPGLCD46 field to a new value. */
#define BW_LCD_WF46_BPGLCD46(x, v) (BME_BFI8(HW_LCD_WF46_ADDR(x), ((uint8_t)(v) << BP_LCD_WF46_BPGLCD46), BP_LCD_WF46_BPGLCD46, 1))
/*@}*/

/*!
 * @name Register LCD_WF46, field BPHLCD46[7] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase H
 * - 1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
#define BP_LCD_WF46_BPHLCD46 (7U)          /*!< Bit position for LCD_WF46_BPHLCD46. */
#define BM_LCD_WF46_BPHLCD46 (0x80U)       /*!< Bit mask for LCD_WF46_BPHLCD46. */
#define BS_LCD_WF46_BPHLCD46 (1U)          /*!< Bit field size in bits for LCD_WF46_BPHLCD46. */

/*! @brief Read current value of the LCD_WF46_BPHLCD46 field. */
#define BR_LCD_WF46_BPHLCD46(x) (BME_UBFX8(HW_LCD_WF46_ADDR(x), BP_LCD_WF46_BPHLCD46, BS_LCD_WF46_BPHLCD46))

/*! @brief Format value for bitfield LCD_WF46_BPHLCD46. */
#define BF_LCD_WF46_BPHLCD46(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF46_BPHLCD46) & BM_LCD_WF46_BPHLCD46)

/*! @brief Set the BPHLCD46 field to a new value. */
#define BW_LCD_WF46_BPHLCD46(x, v) (BME_BFI8(HW_LCD_WF46_ADDR(x), ((uint8_t)(v) << BP_LCD_WF46_BPHLCD46), BP_LCD_WF46_BPHLCD46, 1))
/*@}*/
/*******************************************************************************
 * HW_LCD_WF47 - LCD Waveform Register 47.
 ******************************************************************************/

/*!
 * @brief HW_LCD_WF47 - LCD Waveform Register 47. (RW)
 *
 * Reset value: 0x00U
 */
typedef union _hw_lcd_wf47
{
    uint8_t U;
    struct _hw_lcd_wf47_bitfields
    {
        uint8_t BPALCD47 : 1;          /*!< [0]  */
        uint8_t BPBLCD47 : 1;          /*!< [1]  */
        uint8_t BPCLCD47 : 1;          /*!< [2]  */
        uint8_t BPDLCD47 : 1;          /*!< [3]  */
        uint8_t BPELCD47 : 1;          /*!< [4]  */
        uint8_t BPFLCD47 : 1;          /*!< [5]  */
        uint8_t BPGLCD47 : 1;          /*!< [6]  */
        uint8_t BPHLCD47 : 1;          /*!< [7]  */
    } B;
} hw_lcd_wf47_t;

/*!
 * @name Constants and macros for entire LCD_WF47 register
 */
/*@{*/
#define HW_LCD_WF47_ADDR(x)      ((x) + 0x4FU)

#define HW_LCD_WF47(x)           (*(__IO hw_lcd_wf47_t *) HW_LCD_WF47_ADDR(x))
#define HW_LCD_WF47_RD(x)        (HW_LCD_WF47(x).U)
#define HW_LCD_WF47_WR(x, v)     (HW_LCD_WF47(x).U = (v))
#define HW_LCD_WF47_SET(x, v)    (BME_OR8(HW_LCD_WF47_ADDR(x), (uint8_t)(v)))
#define HW_LCD_WF47_CLR(x, v)    (BME_AND8(HW_LCD_WF47_ADDR(x), (uint8_t)(~(v))))
#define HW_LCD_WF47_TOG(x, v)    (BME_XOR8(HW_LCD_WF47_ADDR(x), (uint8_t)(v)))
/*@}*/

