nevinxu/HM502B2/platform/CMSIS/Include/device/MKL33Z4/MKL33Z4_lcd.h
/*
 * Constants & macros for individual LCD_WF47 bitfields
 */

/*!
 * @name Register LCD_WF47, field BPALCD47[0] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase A
 * - 1 - LCD segment on or LCD backplane active for phase A
 */
/*@{*/
#define BP_LCD_WF47_BPALCD47 (0U)          /*!< Bit position for LCD_WF47_BPALCD47. */
#define BM_LCD_WF47_BPALCD47 (0x01U)       /*!< Bit mask for LCD_WF47_BPALCD47. */
#define BS_LCD_WF47_BPALCD47 (1U)          /*!< Bit field size in bits for LCD_WF47_BPALCD47. */

/*! @brief Read current value of the LCD_WF47_BPALCD47 field. */
#define BR_LCD_WF47_BPALCD47(x) (BME_UBFX8(HW_LCD_WF47_ADDR(x), BP_LCD_WF47_BPALCD47, BS_LCD_WF47_BPALCD47))

/*! @brief Format value for bitfield LCD_WF47_BPALCD47. */
#define BF_LCD_WF47_BPALCD47(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF47_BPALCD47) & BM_LCD_WF47_BPALCD47)

/*! @brief Set the BPALCD47 field to a new value. */
#define BW_LCD_WF47_BPALCD47(x, v) (BME_BFI8(HW_LCD_WF47_ADDR(x), ((uint8_t)(v) << BP_LCD_WF47_BPALCD47), BP_LCD_WF47_BPALCD47, 1))
/*@}*/

/*!
 * @name Register LCD_WF47, field BPBLCD47[1] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase B
 * - 1 - LCD segment on or LCD backplane active for phase B
 */
/*@{*/
#define BP_LCD_WF47_BPBLCD47 (1U)          /*!< Bit position for LCD_WF47_BPBLCD47. */
#define BM_LCD_WF47_BPBLCD47 (0x02U)       /*!< Bit mask for LCD_WF47_BPBLCD47. */
#define BS_LCD_WF47_BPBLCD47 (1U)          /*!< Bit field size in bits for LCD_WF47_BPBLCD47. */

/*! @brief Read current value of the LCD_WF47_BPBLCD47 field. */
#define BR_LCD_WF47_BPBLCD47(x) (BME_UBFX8(HW_LCD_WF47_ADDR(x), BP_LCD_WF47_BPBLCD47, BS_LCD_WF47_BPBLCD47))

/*! @brief Format value for bitfield LCD_WF47_BPBLCD47. */
#define BF_LCD_WF47_BPBLCD47(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF47_BPBLCD47) & BM_LCD_WF47_BPBLCD47)

/*! @brief Set the BPBLCD47 field to a new value. */
#define BW_LCD_WF47_BPBLCD47(x, v) (BME_BFI8(HW_LCD_WF47_ADDR(x), ((uint8_t)(v) << BP_LCD_WF47_BPBLCD47), BP_LCD_WF47_BPBLCD47, 1))
/*@}*/

/*!
 * @name Register LCD_WF47, field BPCLCD47[2] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase C
 * - 1 - LCD segment on or LCD backplane active for phase C
 */
/*@{*/
#define BP_LCD_WF47_BPCLCD47 (2U)          /*!< Bit position for LCD_WF47_BPCLCD47. */
#define BM_LCD_WF47_BPCLCD47 (0x04U)       /*!< Bit mask for LCD_WF47_BPCLCD47. */
#define BS_LCD_WF47_BPCLCD47 (1U)          /*!< Bit field size in bits for LCD_WF47_BPCLCD47. */

/*! @brief Read current value of the LCD_WF47_BPCLCD47 field. */
#define BR_LCD_WF47_BPCLCD47(x) (BME_UBFX8(HW_LCD_WF47_ADDR(x), BP_LCD_WF47_BPCLCD47, BS_LCD_WF47_BPCLCD47))

/*! @brief Format value for bitfield LCD_WF47_BPCLCD47. */
#define BF_LCD_WF47_BPCLCD47(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF47_BPCLCD47) & BM_LCD_WF47_BPCLCD47)

/*! @brief Set the BPCLCD47 field to a new value. */
#define BW_LCD_WF47_BPCLCD47(x, v) (BME_BFI8(HW_LCD_WF47_ADDR(x), ((uint8_t)(v) << BP_LCD_WF47_BPCLCD47), BP_LCD_WF47_BPCLCD47, 1))
/*@}*/

/*!
 * @name Register LCD_WF47, field BPDLCD47[3] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase D
 * - 1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
#define BP_LCD_WF47_BPDLCD47 (3U)          /*!< Bit position for LCD_WF47_BPDLCD47. */
#define BM_LCD_WF47_BPDLCD47 (0x08U)       /*!< Bit mask for LCD_WF47_BPDLCD47. */
#define BS_LCD_WF47_BPDLCD47 (1U)          /*!< Bit field size in bits for LCD_WF47_BPDLCD47. */

/*! @brief Read current value of the LCD_WF47_BPDLCD47 field. */
#define BR_LCD_WF47_BPDLCD47(x) (BME_UBFX8(HW_LCD_WF47_ADDR(x), BP_LCD_WF47_BPDLCD47, BS_LCD_WF47_BPDLCD47))

/*! @brief Format value for bitfield LCD_WF47_BPDLCD47. */
#define BF_LCD_WF47_BPDLCD47(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF47_BPDLCD47) & BM_LCD_WF47_BPDLCD47)

/*! @brief Set the BPDLCD47 field to a new value. */
#define BW_LCD_WF47_BPDLCD47(x, v) (BME_BFI8(HW_LCD_WF47_ADDR(x), ((uint8_t)(v) << BP_LCD_WF47_BPDLCD47), BP_LCD_WF47_BPDLCD47, 1))
/*@}*/

/*!
 * @name Register LCD_WF47, field BPELCD47[4] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase E
 * - 1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
#define BP_LCD_WF47_BPELCD47 (4U)          /*!< Bit position for LCD_WF47_BPELCD47. */
#define BM_LCD_WF47_BPELCD47 (0x10U)       /*!< Bit mask for LCD_WF47_BPELCD47. */
#define BS_LCD_WF47_BPELCD47 (1U)          /*!< Bit field size in bits for LCD_WF47_BPELCD47. */

/*! @brief Read current value of the LCD_WF47_BPELCD47 field. */
#define BR_LCD_WF47_BPELCD47(x) (BME_UBFX8(HW_LCD_WF47_ADDR(x), BP_LCD_WF47_BPELCD47, BS_LCD_WF47_BPELCD47))

/*! @brief Format value for bitfield LCD_WF47_BPELCD47. */
#define BF_LCD_WF47_BPELCD47(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF47_BPELCD47) & BM_LCD_WF47_BPELCD47)

/*! @brief Set the BPELCD47 field to a new value. */
#define BW_LCD_WF47_BPELCD47(x, v) (BME_BFI8(HW_LCD_WF47_ADDR(x), ((uint8_t)(v) << BP_LCD_WF47_BPELCD47), BP_LCD_WF47_BPELCD47, 1))
/*@}*/

/*!
 * @name Register LCD_WF47, field BPFLCD47[5] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase F
 * - 1 - LCD segment on or LCD backplane active for phase F
 */
/*@{*/
#define BP_LCD_WF47_BPFLCD47 (5U)          /*!< Bit position for LCD_WF47_BPFLCD47. */
#define BM_LCD_WF47_BPFLCD47 (0x20U)       /*!< Bit mask for LCD_WF47_BPFLCD47. */
#define BS_LCD_WF47_BPFLCD47 (1U)          /*!< Bit field size in bits for LCD_WF47_BPFLCD47. */

/*! @brief Read current value of the LCD_WF47_BPFLCD47 field. */
#define BR_LCD_WF47_BPFLCD47(x) (BME_UBFX8(HW_LCD_WF47_ADDR(x), BP_LCD_WF47_BPFLCD47, BS_LCD_WF47_BPFLCD47))

/*! @brief Format value for bitfield LCD_WF47_BPFLCD47. */
#define BF_LCD_WF47_BPFLCD47(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF47_BPFLCD47) & BM_LCD_WF47_BPFLCD47)

/*! @brief Set the BPFLCD47 field to a new value. */
#define BW_LCD_WF47_BPFLCD47(x, v) (BME_BFI8(HW_LCD_WF47_ADDR(x), ((uint8_t)(v) << BP_LCD_WF47_BPFLCD47), BP_LCD_WF47_BPFLCD47, 1))
/*@}*/

/*!
 * @name Register LCD_WF47, field BPGLCD47[6] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase G
 * - 1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
#define BP_LCD_WF47_BPGLCD47 (6U)          /*!< Bit position for LCD_WF47_BPGLCD47. */
#define BM_LCD_WF47_BPGLCD47 (0x40U)       /*!< Bit mask for LCD_WF47_BPGLCD47. */
#define BS_LCD_WF47_BPGLCD47 (1U)          /*!< Bit field size in bits for LCD_WF47_BPGLCD47. */

/*! @brief Read current value of the LCD_WF47_BPGLCD47 field. */
#define BR_LCD_WF47_BPGLCD47(x) (BME_UBFX8(HW_LCD_WF47_ADDR(x), BP_LCD_WF47_BPGLCD47, BS_LCD_WF47_BPGLCD47))

/*! @brief Format value for bitfield LCD_WF47_BPGLCD47. */
#define BF_LCD_WF47_BPGLCD47(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF47_BPGLCD47) & BM_LCD_WF47_BPGLCD47)

/*! @brief Set the BPGLCD47 field to a new value. */
#define BW_LCD_WF47_BPGLCD47(x, v) (BME_BFI8(HW_LCD_WF47_ADDR(x), ((uint8_t)(v) << BP_LCD_WF47_BPGLCD47), BP_LCD_WF47_BPGLCD47, 1))
/*@}*/

/*!
 * @name Register LCD_WF47, field BPHLCD47[7] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase H
 * - 1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
#define BP_LCD_WF47_BPHLCD47 (7U)          /*!< Bit position for LCD_WF47_BPHLCD47. */
#define BM_LCD_WF47_BPHLCD47 (0x80U)       /*!< Bit mask for LCD_WF47_BPHLCD47. */
#define BS_LCD_WF47_BPHLCD47 (1U)          /*!< Bit field size in bits for LCD_WF47_BPHLCD47. */

