nevinxu/HM502B2/platform/CMSIS/Include/device/MKL33Z4/MKL33Z4_lcd.h
/*! @brief Set the BPGLCD50 field to a new value. */
#define BW_LCD_WF50_BPGLCD50(x, v) (BME_BFI8(HW_LCD_WF50_ADDR(x), ((uint8_t)(v) << BP_LCD_WF50_BPGLCD50), BP_LCD_WF50_BPGLCD50, 1))
/*@}*/

/*!
 * @name Register LCD_WF50, field BPHLCD50[7] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase H
 * - 1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
#define BP_LCD_WF50_BPHLCD50 (7U)          /*!< Bit position for LCD_WF50_BPHLCD50. */
#define BM_LCD_WF50_BPHLCD50 (0x80U)       /*!< Bit mask for LCD_WF50_BPHLCD50. */
#define BS_LCD_WF50_BPHLCD50 (1U)          /*!< Bit field size in bits for LCD_WF50_BPHLCD50. */

/*! @brief Read current value of the LCD_WF50_BPHLCD50 field. */
#define BR_LCD_WF50_BPHLCD50(x) (BME_UBFX8(HW_LCD_WF50_ADDR(x), BP_LCD_WF50_BPHLCD50, BS_LCD_WF50_BPHLCD50))

/*! @brief Format value for bitfield LCD_WF50_BPHLCD50. */
#define BF_LCD_WF50_BPHLCD50(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF50_BPHLCD50) & BM_LCD_WF50_BPHLCD50)

/*! @brief Set the BPHLCD50 field to a new value. */
#define BW_LCD_WF50_BPHLCD50(x, v) (BME_BFI8(HW_LCD_WF50_ADDR(x), ((uint8_t)(v) << BP_LCD_WF50_BPHLCD50), BP_LCD_WF50_BPHLCD50, 1))
/*@}*/
/*******************************************************************************
 * HW_LCD_WF51 - LCD Waveform Register 51.
 ******************************************************************************/

/*!
 * @brief HW_LCD_WF51 - LCD Waveform Register 51. (RW)
 *
 * Reset value: 0x00U
 */
typedef union _hw_lcd_wf51
{
    uint8_t U;
    struct _hw_lcd_wf51_bitfields
    {
        uint8_t BPALCD51 : 1;          /*!< [0]  */
        uint8_t BPBLCD51 : 1;          /*!< [1]  */
        uint8_t BPCLCD51 : 1;          /*!< [2]  */
        uint8_t BPDLCD51 : 1;          /*!< [3]  */
        uint8_t BPELCD51 : 1;          /*!< [4]  */
        uint8_t BPFLCD51 : 1;          /*!< [5]  */
        uint8_t BPGLCD51 : 1;          /*!< [6]  */
        uint8_t BPHLCD51 : 1;          /*!< [7]  */
    } B;
} hw_lcd_wf51_t;

/*!
 * @name Constants and macros for entire LCD_WF51 register
 */
/*@{*/
#define HW_LCD_WF51_ADDR(x)      ((x) + 0x53U)

#define HW_LCD_WF51(x)           (*(__IO hw_lcd_wf51_t *) HW_LCD_WF51_ADDR(x))
#define HW_LCD_WF51_RD(x)        (HW_LCD_WF51(x).U)
#define HW_LCD_WF51_WR(x, v)     (HW_LCD_WF51(x).U = (v))
#define HW_LCD_WF51_SET(x, v)    (BME_OR8(HW_LCD_WF51_ADDR(x), (uint8_t)(v)))
#define HW_LCD_WF51_CLR(x, v)    (BME_AND8(HW_LCD_WF51_ADDR(x), (uint8_t)(~(v))))
#define HW_LCD_WF51_TOG(x, v)    (BME_XOR8(HW_LCD_WF51_ADDR(x), (uint8_t)(v)))
/*@}*/

/*
 * Constants & macros for individual LCD_WF51 bitfields
 */

/*!
 * @name Register LCD_WF51, field BPALCD51[0] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase A
 * - 1 - LCD segment on or LCD backplane active for phase A
 */
/*@{*/
#define BP_LCD_WF51_BPALCD51 (0U)          /*!< Bit position for LCD_WF51_BPALCD51. */
#define BM_LCD_WF51_BPALCD51 (0x01U)       /*!< Bit mask for LCD_WF51_BPALCD51. */
#define BS_LCD_WF51_BPALCD51 (1U)          /*!< Bit field size in bits for LCD_WF51_BPALCD51. */

/*! @brief Read current value of the LCD_WF51_BPALCD51 field. */
#define BR_LCD_WF51_BPALCD51(x) (BME_UBFX8(HW_LCD_WF51_ADDR(x), BP_LCD_WF51_BPALCD51, BS_LCD_WF51_BPALCD51))

/*! @brief Format value for bitfield LCD_WF51_BPALCD51. */
#define BF_LCD_WF51_BPALCD51(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF51_BPALCD51) & BM_LCD_WF51_BPALCD51)

/*! @brief Set the BPALCD51 field to a new value. */
#define BW_LCD_WF51_BPALCD51(x, v) (BME_BFI8(HW_LCD_WF51_ADDR(x), ((uint8_t)(v) << BP_LCD_WF51_BPALCD51), BP_LCD_WF51_BPALCD51, 1))
/*@}*/

/*!
 * @name Register LCD_WF51, field BPBLCD51[1] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase B
 * - 1 - LCD segment on or LCD backplane active for phase B
 */
/*@{*/
#define BP_LCD_WF51_BPBLCD51 (1U)          /*!< Bit position for LCD_WF51_BPBLCD51. */
#define BM_LCD_WF51_BPBLCD51 (0x02U)       /*!< Bit mask for LCD_WF51_BPBLCD51. */
#define BS_LCD_WF51_BPBLCD51 (1U)          /*!< Bit field size in bits for LCD_WF51_BPBLCD51. */

/*! @brief Read current value of the LCD_WF51_BPBLCD51 field. */
#define BR_LCD_WF51_BPBLCD51(x) (BME_UBFX8(HW_LCD_WF51_ADDR(x), BP_LCD_WF51_BPBLCD51, BS_LCD_WF51_BPBLCD51))

/*! @brief Format value for bitfield LCD_WF51_BPBLCD51. */
#define BF_LCD_WF51_BPBLCD51(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF51_BPBLCD51) & BM_LCD_WF51_BPBLCD51)

/*! @brief Set the BPBLCD51 field to a new value. */
#define BW_LCD_WF51_BPBLCD51(x, v) (BME_BFI8(HW_LCD_WF51_ADDR(x), ((uint8_t)(v) << BP_LCD_WF51_BPBLCD51), BP_LCD_WF51_BPBLCD51, 1))
/*@}*/

/*!
 * @name Register LCD_WF51, field BPCLCD51[2] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase C
 * - 1 - LCD segment on or LCD backplane active for phase C
 */
/*@{*/
#define BP_LCD_WF51_BPCLCD51 (2U)          /*!< Bit position for LCD_WF51_BPCLCD51. */
#define BM_LCD_WF51_BPCLCD51 (0x04U)       /*!< Bit mask for LCD_WF51_BPCLCD51. */
#define BS_LCD_WF51_BPCLCD51 (1U)          /*!< Bit field size in bits for LCD_WF51_BPCLCD51. */

/*! @brief Read current value of the LCD_WF51_BPCLCD51 field. */
#define BR_LCD_WF51_BPCLCD51(x) (BME_UBFX8(HW_LCD_WF51_ADDR(x), BP_LCD_WF51_BPCLCD51, BS_LCD_WF51_BPCLCD51))

/*! @brief Format value for bitfield LCD_WF51_BPCLCD51. */
#define BF_LCD_WF51_BPCLCD51(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF51_BPCLCD51) & BM_LCD_WF51_BPCLCD51)

/*! @brief Set the BPCLCD51 field to a new value. */
#define BW_LCD_WF51_BPCLCD51(x, v) (BME_BFI8(HW_LCD_WF51_ADDR(x), ((uint8_t)(v) << BP_LCD_WF51_BPCLCD51), BP_LCD_WF51_BPCLCD51, 1))
/*@}*/

/*!
 * @name Register LCD_WF51, field BPDLCD51[3] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase D
 * - 1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
#define BP_LCD_WF51_BPDLCD51 (3U)          /*!< Bit position for LCD_WF51_BPDLCD51. */
#define BM_LCD_WF51_BPDLCD51 (0x08U)       /*!< Bit mask for LCD_WF51_BPDLCD51. */
#define BS_LCD_WF51_BPDLCD51 (1U)          /*!< Bit field size in bits for LCD_WF51_BPDLCD51. */

/*! @brief Read current value of the LCD_WF51_BPDLCD51 field. */
#define BR_LCD_WF51_BPDLCD51(x) (BME_UBFX8(HW_LCD_WF51_ADDR(x), BP_LCD_WF51_BPDLCD51, BS_LCD_WF51_BPDLCD51))

/*! @brief Format value for bitfield LCD_WF51_BPDLCD51. */
#define BF_LCD_WF51_BPDLCD51(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF51_BPDLCD51) & BM_LCD_WF51_BPDLCD51)

