nevinxu/HM502B2/platform/CMSIS/Include/device/MKL33Z4/MKL33Z4_lcd.h
/*! @brief Format value for bitfield LCD_WF52_BPALCD52. */
#define BF_LCD_WF52_BPALCD52(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF52_BPALCD52) & BM_LCD_WF52_BPALCD52)

/*! @brief Set the BPALCD52 field to a new value. */
#define BW_LCD_WF52_BPALCD52(x, v) (BME_BFI8(HW_LCD_WF52_ADDR(x), ((uint8_t)(v) << BP_LCD_WF52_BPALCD52), BP_LCD_WF52_BPALCD52, 1))
/*@}*/

/*!
 * @name Register LCD_WF52, field BPBLCD52[1] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase B
 * - 1 - LCD segment on or LCD backplane active for phase B
 */
/*@{*/
#define BP_LCD_WF52_BPBLCD52 (1U)          /*!< Bit position for LCD_WF52_BPBLCD52. */
#define BM_LCD_WF52_BPBLCD52 (0x02U)       /*!< Bit mask for LCD_WF52_BPBLCD52. */
#define BS_LCD_WF52_BPBLCD52 (1U)          /*!< Bit field size in bits for LCD_WF52_BPBLCD52. */

/*! @brief Read current value of the LCD_WF52_BPBLCD52 field. */
#define BR_LCD_WF52_BPBLCD52(x) (BME_UBFX8(HW_LCD_WF52_ADDR(x), BP_LCD_WF52_BPBLCD52, BS_LCD_WF52_BPBLCD52))

/*! @brief Format value for bitfield LCD_WF52_BPBLCD52. */
#define BF_LCD_WF52_BPBLCD52(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF52_BPBLCD52) & BM_LCD_WF52_BPBLCD52)

/*! @brief Set the BPBLCD52 field to a new value. */
#define BW_LCD_WF52_BPBLCD52(x, v) (BME_BFI8(HW_LCD_WF52_ADDR(x), ((uint8_t)(v) << BP_LCD_WF52_BPBLCD52), BP_LCD_WF52_BPBLCD52, 1))
/*@}*/

/*!
 * @name Register LCD_WF52, field BPCLCD52[2] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase C
 * - 1 - LCD segment on or LCD backplane active for phase C
 */
/*@{*/
#define BP_LCD_WF52_BPCLCD52 (2U)          /*!< Bit position for LCD_WF52_BPCLCD52. */
#define BM_LCD_WF52_BPCLCD52 (0x04U)       /*!< Bit mask for LCD_WF52_BPCLCD52. */
#define BS_LCD_WF52_BPCLCD52 (1U)          /*!< Bit field size in bits for LCD_WF52_BPCLCD52. */

/*! @brief Read current value of the LCD_WF52_BPCLCD52 field. */
#define BR_LCD_WF52_BPCLCD52(x) (BME_UBFX8(HW_LCD_WF52_ADDR(x), BP_LCD_WF52_BPCLCD52, BS_LCD_WF52_BPCLCD52))

/*! @brief Format value for bitfield LCD_WF52_BPCLCD52. */
#define BF_LCD_WF52_BPCLCD52(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF52_BPCLCD52) & BM_LCD_WF52_BPCLCD52)

/*! @brief Set the BPCLCD52 field to a new value. */
#define BW_LCD_WF52_BPCLCD52(x, v) (BME_BFI8(HW_LCD_WF52_ADDR(x), ((uint8_t)(v) << BP_LCD_WF52_BPCLCD52), BP_LCD_WF52_BPCLCD52, 1))
/*@}*/

/*!
 * @name Register LCD_WF52, field BPDLCD52[3] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase D
 * - 1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
#define BP_LCD_WF52_BPDLCD52 (3U)          /*!< Bit position for LCD_WF52_BPDLCD52. */
#define BM_LCD_WF52_BPDLCD52 (0x08U)       /*!< Bit mask for LCD_WF52_BPDLCD52. */
#define BS_LCD_WF52_BPDLCD52 (1U)          /*!< Bit field size in bits for LCD_WF52_BPDLCD52. */

/*! @brief Read current value of the LCD_WF52_BPDLCD52 field. */
#define BR_LCD_WF52_BPDLCD52(x) (BME_UBFX8(HW_LCD_WF52_ADDR(x), BP_LCD_WF52_BPDLCD52, BS_LCD_WF52_BPDLCD52))

/*! @brief Format value for bitfield LCD_WF52_BPDLCD52. */
#define BF_LCD_WF52_BPDLCD52(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF52_BPDLCD52) & BM_LCD_WF52_BPDLCD52)

/*! @brief Set the BPDLCD52 field to a new value. */
#define BW_LCD_WF52_BPDLCD52(x, v) (BME_BFI8(HW_LCD_WF52_ADDR(x), ((uint8_t)(v) << BP_LCD_WF52_BPDLCD52), BP_LCD_WF52_BPDLCD52, 1))
/*@}*/

/*!
 * @name Register LCD_WF52, field BPELCD52[4] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase E
 * - 1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
#define BP_LCD_WF52_BPELCD52 (4U)          /*!< Bit position for LCD_WF52_BPELCD52. */
#define BM_LCD_WF52_BPELCD52 (0x10U)       /*!< Bit mask for LCD_WF52_BPELCD52. */
#define BS_LCD_WF52_BPELCD52 (1U)          /*!< Bit field size in bits for LCD_WF52_BPELCD52. */

/*! @brief Read current value of the LCD_WF52_BPELCD52 field. */
#define BR_LCD_WF52_BPELCD52(x) (BME_UBFX8(HW_LCD_WF52_ADDR(x), BP_LCD_WF52_BPELCD52, BS_LCD_WF52_BPELCD52))

/*! @brief Format value for bitfield LCD_WF52_BPELCD52. */
#define BF_LCD_WF52_BPELCD52(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF52_BPELCD52) & BM_LCD_WF52_BPELCD52)

/*! @brief Set the BPELCD52 field to a new value. */
#define BW_LCD_WF52_BPELCD52(x, v) (BME_BFI8(HW_LCD_WF52_ADDR(x), ((uint8_t)(v) << BP_LCD_WF52_BPELCD52), BP_LCD_WF52_BPELCD52, 1))
/*@}*/

/*!
 * @name Register LCD_WF52, field BPFLCD52[5] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase F
 * - 1 - LCD segment on or LCD backplane active for phase F
 */
/*@{*/
#define BP_LCD_WF52_BPFLCD52 (5U)          /*!< Bit position for LCD_WF52_BPFLCD52. */
#define BM_LCD_WF52_BPFLCD52 (0x20U)       /*!< Bit mask for LCD_WF52_BPFLCD52. */
#define BS_LCD_WF52_BPFLCD52 (1U)          /*!< Bit field size in bits for LCD_WF52_BPFLCD52. */

/*! @brief Read current value of the LCD_WF52_BPFLCD52 field. */
#define BR_LCD_WF52_BPFLCD52(x) (BME_UBFX8(HW_LCD_WF52_ADDR(x), BP_LCD_WF52_BPFLCD52, BS_LCD_WF52_BPFLCD52))

/*! @brief Format value for bitfield LCD_WF52_BPFLCD52. */
#define BF_LCD_WF52_BPFLCD52(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF52_BPFLCD52) & BM_LCD_WF52_BPFLCD52)

/*! @brief Set the BPFLCD52 field to a new value. */
#define BW_LCD_WF52_BPFLCD52(x, v) (BME_BFI8(HW_LCD_WF52_ADDR(x), ((uint8_t)(v) << BP_LCD_WF52_BPFLCD52), BP_LCD_WF52_BPFLCD52, 1))
/*@}*/

/*!
 * @name Register LCD_WF52, field BPGLCD52[6] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase G
 * - 1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
#define BP_LCD_WF52_BPGLCD52 (6U)          /*!< Bit position for LCD_WF52_BPGLCD52. */
#define BM_LCD_WF52_BPGLCD52 (0x40U)       /*!< Bit mask for LCD_WF52_BPGLCD52. */
#define BS_LCD_WF52_BPGLCD52 (1U)          /*!< Bit field size in bits for LCD_WF52_BPGLCD52. */

/*! @brief Read current value of the LCD_WF52_BPGLCD52 field. */
#define BR_LCD_WF52_BPGLCD52(x) (BME_UBFX8(HW_LCD_WF52_ADDR(x), BP_LCD_WF52_BPGLCD52, BS_LCD_WF52_BPGLCD52))

/*! @brief Format value for bitfield LCD_WF52_BPGLCD52. */
#define BF_LCD_WF52_BPGLCD52(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF52_BPGLCD52) & BM_LCD_WF52_BPGLCD52)

/*! @brief Set the BPGLCD52 field to a new value. */
#define BW_LCD_WF52_BPGLCD52(x, v) (BME_BFI8(HW_LCD_WF52_ADDR(x), ((uint8_t)(v) << BP_LCD_WF52_BPGLCD52), BP_LCD_WF52_BPGLCD52, 1))
/*@}*/

/*!
 * @name Register LCD_WF52, field BPHLCD52[7] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase H
 * - 1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
#define BP_LCD_WF52_BPHLCD52 (7U)          /*!< Bit position for LCD_WF52_BPHLCD52. */
#define BM_LCD_WF52_BPHLCD52 (0x80U)       /*!< Bit mask for LCD_WF52_BPHLCD52. */
#define BS_LCD_WF52_BPHLCD52 (1U)          /*!< Bit field size in bits for LCD_WF52_BPHLCD52. */

