nevinxu/HM502B2/platform/CMSIS/Include/device/MKL33Z4/MKL33Z4_lcd.h
/*! @brief Format value for bitfield LCD_WF54_BPELCD54. */
#define BF_LCD_WF54_BPELCD54(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF54_BPELCD54) & BM_LCD_WF54_BPELCD54)

/*! @brief Set the BPELCD54 field to a new value. */
#define BW_LCD_WF54_BPELCD54(x, v) (BME_BFI8(HW_LCD_WF54_ADDR(x), ((uint8_t)(v) << BP_LCD_WF54_BPELCD54), BP_LCD_WF54_BPELCD54, 1))
/*@}*/

/*!
 * @name Register LCD_WF54, field BPFLCD54[5] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase F
 * - 1 - LCD segment on or LCD backplane active for phase F
 */
/*@{*/
#define BP_LCD_WF54_BPFLCD54 (5U)          /*!< Bit position for LCD_WF54_BPFLCD54. */
#define BM_LCD_WF54_BPFLCD54 (0x20U)       /*!< Bit mask for LCD_WF54_BPFLCD54. */
#define BS_LCD_WF54_BPFLCD54 (1U)          /*!< Bit field size in bits for LCD_WF54_BPFLCD54. */

/*! @brief Read current value of the LCD_WF54_BPFLCD54 field. */
#define BR_LCD_WF54_BPFLCD54(x) (BME_UBFX8(HW_LCD_WF54_ADDR(x), BP_LCD_WF54_BPFLCD54, BS_LCD_WF54_BPFLCD54))

/*! @brief Format value for bitfield LCD_WF54_BPFLCD54. */
#define BF_LCD_WF54_BPFLCD54(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF54_BPFLCD54) & BM_LCD_WF54_BPFLCD54)

/*! @brief Set the BPFLCD54 field to a new value. */
#define BW_LCD_WF54_BPFLCD54(x, v) (BME_BFI8(HW_LCD_WF54_ADDR(x), ((uint8_t)(v) << BP_LCD_WF54_BPFLCD54), BP_LCD_WF54_BPFLCD54, 1))
/*@}*/

/*!
 * @name Register LCD_WF54, field BPGLCD54[6] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase G
 * - 1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
#define BP_LCD_WF54_BPGLCD54 (6U)          /*!< Bit position for LCD_WF54_BPGLCD54. */
#define BM_LCD_WF54_BPGLCD54 (0x40U)       /*!< Bit mask for LCD_WF54_BPGLCD54. */
#define BS_LCD_WF54_BPGLCD54 (1U)          /*!< Bit field size in bits for LCD_WF54_BPGLCD54. */

/*! @brief Read current value of the LCD_WF54_BPGLCD54 field. */
#define BR_LCD_WF54_BPGLCD54(x) (BME_UBFX8(HW_LCD_WF54_ADDR(x), BP_LCD_WF54_BPGLCD54, BS_LCD_WF54_BPGLCD54))

/*! @brief Format value for bitfield LCD_WF54_BPGLCD54. */
#define BF_LCD_WF54_BPGLCD54(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF54_BPGLCD54) & BM_LCD_WF54_BPGLCD54)

/*! @brief Set the BPGLCD54 field to a new value. */
#define BW_LCD_WF54_BPGLCD54(x, v) (BME_BFI8(HW_LCD_WF54_ADDR(x), ((uint8_t)(v) << BP_LCD_WF54_BPGLCD54), BP_LCD_WF54_BPGLCD54, 1))
/*@}*/

/*!
 * @name Register LCD_WF54, field BPHLCD54[7] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase H
 * - 1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
#define BP_LCD_WF54_BPHLCD54 (7U)          /*!< Bit position for LCD_WF54_BPHLCD54. */
#define BM_LCD_WF54_BPHLCD54 (0x80U)       /*!< Bit mask for LCD_WF54_BPHLCD54. */
#define BS_LCD_WF54_BPHLCD54 (1U)          /*!< Bit field size in bits for LCD_WF54_BPHLCD54. */

/*! @brief Read current value of the LCD_WF54_BPHLCD54 field. */
#define BR_LCD_WF54_BPHLCD54(x) (BME_UBFX8(HW_LCD_WF54_ADDR(x), BP_LCD_WF54_BPHLCD54, BS_LCD_WF54_BPHLCD54))

/*! @brief Format value for bitfield LCD_WF54_BPHLCD54. */
#define BF_LCD_WF54_BPHLCD54(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF54_BPHLCD54) & BM_LCD_WF54_BPHLCD54)

/*! @brief Set the BPHLCD54 field to a new value. */
#define BW_LCD_WF54_BPHLCD54(x, v) (BME_BFI8(HW_LCD_WF54_ADDR(x), ((uint8_t)(v) << BP_LCD_WF54_BPHLCD54), BP_LCD_WF54_BPHLCD54, 1))
/*@}*/
/*******************************************************************************
 * HW_LCD_WF55 - LCD Waveform Register 55.
 ******************************************************************************/

/*!
 * @brief HW_LCD_WF55 - LCD Waveform Register 55. (RW)
 *
 * Reset value: 0x00U
 */
typedef union _hw_lcd_wf55
{
    uint8_t U;
    struct _hw_lcd_wf55_bitfields
    {
        uint8_t BPALCD55 : 1;          /*!< [0]  */
        uint8_t BPBLCD55 : 1;          /*!< [1]  */
        uint8_t BPCLCD55 : 1;          /*!< [2]  */
        uint8_t BPDLCD55 : 1;          /*!< [3]  */
        uint8_t BPELCD55 : 1;          /*!< [4]  */
        uint8_t BPFLCD55 : 1;          /*!< [5]  */
        uint8_t BPGLCD55 : 1;          /*!< [6]  */
        uint8_t BPHLCD55 : 1;          /*!< [7]  */
    } B;
} hw_lcd_wf55_t;

/*!
 * @name Constants and macros for entire LCD_WF55 register
 */
/*@{*/
#define HW_LCD_WF55_ADDR(x)      ((x) + 0x57U)

#define HW_LCD_WF55(x)           (*(__IO hw_lcd_wf55_t *) HW_LCD_WF55_ADDR(x))
#define HW_LCD_WF55_RD(x)        (HW_LCD_WF55(x).U)
#define HW_LCD_WF55_WR(x, v)     (HW_LCD_WF55(x).U = (v))
#define HW_LCD_WF55_SET(x, v)    (BME_OR8(HW_LCD_WF55_ADDR(x), (uint8_t)(v)))
#define HW_LCD_WF55_CLR(x, v)    (BME_AND8(HW_LCD_WF55_ADDR(x), (uint8_t)(~(v))))
#define HW_LCD_WF55_TOG(x, v)    (BME_XOR8(HW_LCD_WF55_ADDR(x), (uint8_t)(v)))
/*@}*/

/*
 * Constants & macros for individual LCD_WF55 bitfields
 */

/*!
 * @name Register LCD_WF55, field BPALCD55[0] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase A
 * - 1 - LCD segment on or LCD backplane active for phase A
 */
/*@{*/
#define BP_LCD_WF55_BPALCD55 (0U)          /*!< Bit position for LCD_WF55_BPALCD55. */
#define BM_LCD_WF55_BPALCD55 (0x01U)       /*!< Bit mask for LCD_WF55_BPALCD55. */
#define BS_LCD_WF55_BPALCD55 (1U)          /*!< Bit field size in bits for LCD_WF55_BPALCD55. */

/*! @brief Read current value of the LCD_WF55_BPALCD55 field. */
#define BR_LCD_WF55_BPALCD55(x) (BME_UBFX8(HW_LCD_WF55_ADDR(x), BP_LCD_WF55_BPALCD55, BS_LCD_WF55_BPALCD55))

/*! @brief Format value for bitfield LCD_WF55_BPALCD55. */
#define BF_LCD_WF55_BPALCD55(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF55_BPALCD55) & BM_LCD_WF55_BPALCD55)

/*! @brief Set the BPALCD55 field to a new value. */
#define BW_LCD_WF55_BPALCD55(x, v) (BME_BFI8(HW_LCD_WF55_ADDR(x), ((uint8_t)(v) << BP_LCD_WF55_BPALCD55), BP_LCD_WF55_BPALCD55, 1))
/*@}*/

/*!
 * @name Register LCD_WF55, field BPBLCD55[1] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase B
 * - 1 - LCD segment on or LCD backplane active for phase B
 */
/*@{*/
#define BP_LCD_WF55_BPBLCD55 (1U)          /*!< Bit position for LCD_WF55_BPBLCD55. */
#define BM_LCD_WF55_BPBLCD55 (0x02U)       /*!< Bit mask for LCD_WF55_BPBLCD55. */
#define BS_LCD_WF55_BPBLCD55 (1U)          /*!< Bit field size in bits for LCD_WF55_BPBLCD55. */

