nevinxu/HM502B2/platform/CMSIS/Include/device/MKL33Z4/MKL33Z4_lcd.h
/*! @brief Read current value of the LCD_WF59_BPDLCD59 field. */
#define BR_LCD_WF59_BPDLCD59(x) (BME_UBFX8(HW_LCD_WF59_ADDR(x), BP_LCD_WF59_BPDLCD59, BS_LCD_WF59_BPDLCD59))

/*! @brief Format value for bitfield LCD_WF59_BPDLCD59. */
#define BF_LCD_WF59_BPDLCD59(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF59_BPDLCD59) & BM_LCD_WF59_BPDLCD59)

/*! @brief Set the BPDLCD59 field to a new value. */
#define BW_LCD_WF59_BPDLCD59(x, v) (BME_BFI8(HW_LCD_WF59_ADDR(x), ((uint8_t)(v) << BP_LCD_WF59_BPDLCD59), BP_LCD_WF59_BPDLCD59, 1))
/*@}*/

/*!
 * @name Register LCD_WF59, field BPELCD59[4] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase E
 * - 1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
#define BP_LCD_WF59_BPELCD59 (4U)          /*!< Bit position for LCD_WF59_BPELCD59. */
#define BM_LCD_WF59_BPELCD59 (0x10U)       /*!< Bit mask for LCD_WF59_BPELCD59. */
#define BS_LCD_WF59_BPELCD59 (1U)          /*!< Bit field size in bits for LCD_WF59_BPELCD59. */

/*! @brief Read current value of the LCD_WF59_BPELCD59 field. */
#define BR_LCD_WF59_BPELCD59(x) (BME_UBFX8(HW_LCD_WF59_ADDR(x), BP_LCD_WF59_BPELCD59, BS_LCD_WF59_BPELCD59))

/*! @brief Format value for bitfield LCD_WF59_BPELCD59. */
#define BF_LCD_WF59_BPELCD59(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF59_BPELCD59) & BM_LCD_WF59_BPELCD59)

/*! @brief Set the BPELCD59 field to a new value. */
#define BW_LCD_WF59_BPELCD59(x, v) (BME_BFI8(HW_LCD_WF59_ADDR(x), ((uint8_t)(v) << BP_LCD_WF59_BPELCD59), BP_LCD_WF59_BPELCD59, 1))
/*@}*/

/*!
 * @name Register LCD_WF59, field BPFLCD59[5] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase F
 * - 1 - LCD segment on or LCD backplane active for phase F
 */
/*@{*/
#define BP_LCD_WF59_BPFLCD59 (5U)          /*!< Bit position for LCD_WF59_BPFLCD59. */
#define BM_LCD_WF59_BPFLCD59 (0x20U)       /*!< Bit mask for LCD_WF59_BPFLCD59. */
#define BS_LCD_WF59_BPFLCD59 (1U)          /*!< Bit field size in bits for LCD_WF59_BPFLCD59. */

/*! @brief Read current value of the LCD_WF59_BPFLCD59 field. */
#define BR_LCD_WF59_BPFLCD59(x) (BME_UBFX8(HW_LCD_WF59_ADDR(x), BP_LCD_WF59_BPFLCD59, BS_LCD_WF59_BPFLCD59))

/*! @brief Format value for bitfield LCD_WF59_BPFLCD59. */
#define BF_LCD_WF59_BPFLCD59(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF59_BPFLCD59) & BM_LCD_WF59_BPFLCD59)

/*! @brief Set the BPFLCD59 field to a new value. */
#define BW_LCD_WF59_BPFLCD59(x, v) (BME_BFI8(HW_LCD_WF59_ADDR(x), ((uint8_t)(v) << BP_LCD_WF59_BPFLCD59), BP_LCD_WF59_BPFLCD59, 1))
/*@}*/

/*!
 * @name Register LCD_WF59, field BPGLCD59[6] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase G
 * - 1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
#define BP_LCD_WF59_BPGLCD59 (6U)          /*!< Bit position for LCD_WF59_BPGLCD59. */
#define BM_LCD_WF59_BPGLCD59 (0x40U)       /*!< Bit mask for LCD_WF59_BPGLCD59. */
#define BS_LCD_WF59_BPGLCD59 (1U)          /*!< Bit field size in bits for LCD_WF59_BPGLCD59. */

/*! @brief Read current value of the LCD_WF59_BPGLCD59 field. */
#define BR_LCD_WF59_BPGLCD59(x) (BME_UBFX8(HW_LCD_WF59_ADDR(x), BP_LCD_WF59_BPGLCD59, BS_LCD_WF59_BPGLCD59))

/*! @brief Format value for bitfield LCD_WF59_BPGLCD59. */
#define BF_LCD_WF59_BPGLCD59(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF59_BPGLCD59) & BM_LCD_WF59_BPGLCD59)

/*! @brief Set the BPGLCD59 field to a new value. */
#define BW_LCD_WF59_BPGLCD59(x, v) (BME_BFI8(HW_LCD_WF59_ADDR(x), ((uint8_t)(v) << BP_LCD_WF59_BPGLCD59), BP_LCD_WF59_BPGLCD59, 1))
/*@}*/

/*!
 * @name Register LCD_WF59, field BPHLCD59[7] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase H
 * - 1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
#define BP_LCD_WF59_BPHLCD59 (7U)          /*!< Bit position for LCD_WF59_BPHLCD59. */
#define BM_LCD_WF59_BPHLCD59 (0x80U)       /*!< Bit mask for LCD_WF59_BPHLCD59. */
#define BS_LCD_WF59_BPHLCD59 (1U)          /*!< Bit field size in bits for LCD_WF59_BPHLCD59. */

/*! @brief Read current value of the LCD_WF59_BPHLCD59 field. */
#define BR_LCD_WF59_BPHLCD59(x) (BME_UBFX8(HW_LCD_WF59_ADDR(x), BP_LCD_WF59_BPHLCD59, BS_LCD_WF59_BPHLCD59))

/*! @brief Format value for bitfield LCD_WF59_BPHLCD59. */
#define BF_LCD_WF59_BPHLCD59(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF59_BPHLCD59) & BM_LCD_WF59_BPHLCD59)

/*! @brief Set the BPHLCD59 field to a new value. */
#define BW_LCD_WF59_BPHLCD59(x, v) (BME_BFI8(HW_LCD_WF59_ADDR(x), ((uint8_t)(v) << BP_LCD_WF59_BPHLCD59), BP_LCD_WF59_BPHLCD59, 1))
/*@}*/
/*******************************************************************************
 * HW_LCD_WF60 - LCD Waveform Register 60.
 ******************************************************************************/

/*!
 * @brief HW_LCD_WF60 - LCD Waveform Register 60. (RW)
 *
 * Reset value: 0x00U
 */
typedef union _hw_lcd_wf60
{
    uint8_t U;
    struct _hw_lcd_wf60_bitfields
    {
        uint8_t BPALCD60 : 1;          /*!< [0]  */
        uint8_t BPBLCD60 : 1;          /*!< [1]  */
        uint8_t BPCLCD60 : 1;          /*!< [2]  */
        uint8_t BPDLCD60 : 1;          /*!< [3]  */
        uint8_t BPELCD60 : 1;          /*!< [4]  */
        uint8_t BPFLCD60 : 1;          /*!< [5]  */
        uint8_t BPGLCD60 : 1;          /*!< [6]  */
        uint8_t BPHLCD60 : 1;          /*!< [7]  */
    } B;
} hw_lcd_wf60_t;

/*!
 * @name Constants and macros for entire LCD_WF60 register
 */
/*@{*/
#define HW_LCD_WF60_ADDR(x)      ((x) + 0x5CU)

#define HW_LCD_WF60(x)           (*(__IO hw_lcd_wf60_t *) HW_LCD_WF60_ADDR(x))
#define HW_LCD_WF60_RD(x)        (HW_LCD_WF60(x).U)
#define HW_LCD_WF60_WR(x, v)     (HW_LCD_WF60(x).U = (v))
#define HW_LCD_WF60_SET(x, v)    (BME_OR8(HW_LCD_WF60_ADDR(x), (uint8_t)(v)))
#define HW_LCD_WF60_CLR(x, v)    (BME_AND8(HW_LCD_WF60_ADDR(x), (uint8_t)(~(v))))
#define HW_LCD_WF60_TOG(x, v)    (BME_XOR8(HW_LCD_WF60_ADDR(x), (uint8_t)(v)))
/*@}*/

