nevinxu/HM502B2/platform/CMSIS/Include/device/MKL33Z4/MKL33Z4_lcd.h
/*! @brief Read current value of the LCD_WF60_BPGLCD60 field. */
#define BR_LCD_WF60_BPGLCD60(x) (BME_UBFX8(HW_LCD_WF60_ADDR(x), BP_LCD_WF60_BPGLCD60, BS_LCD_WF60_BPGLCD60))

/*! @brief Format value for bitfield LCD_WF60_BPGLCD60. */
#define BF_LCD_WF60_BPGLCD60(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF60_BPGLCD60) & BM_LCD_WF60_BPGLCD60)

/*! @brief Set the BPGLCD60 field to a new value. */
#define BW_LCD_WF60_BPGLCD60(x, v) (BME_BFI8(HW_LCD_WF60_ADDR(x), ((uint8_t)(v) << BP_LCD_WF60_BPGLCD60), BP_LCD_WF60_BPGLCD60, 1))
/*@}*/

/*!
 * @name Register LCD_WF60, field BPHLCD60[7] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase H
 * - 1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
#define BP_LCD_WF60_BPHLCD60 (7U)          /*!< Bit position for LCD_WF60_BPHLCD60. */
#define BM_LCD_WF60_BPHLCD60 (0x80U)       /*!< Bit mask for LCD_WF60_BPHLCD60. */
#define BS_LCD_WF60_BPHLCD60 (1U)          /*!< Bit field size in bits for LCD_WF60_BPHLCD60. */

/*! @brief Read current value of the LCD_WF60_BPHLCD60 field. */
#define BR_LCD_WF60_BPHLCD60(x) (BME_UBFX8(HW_LCD_WF60_ADDR(x), BP_LCD_WF60_BPHLCD60, BS_LCD_WF60_BPHLCD60))

/*! @brief Format value for bitfield LCD_WF60_BPHLCD60. */
#define BF_LCD_WF60_BPHLCD60(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF60_BPHLCD60) & BM_LCD_WF60_BPHLCD60)

/*! @brief Set the BPHLCD60 field to a new value. */
#define BW_LCD_WF60_BPHLCD60(x, v) (BME_BFI8(HW_LCD_WF60_ADDR(x), ((uint8_t)(v) << BP_LCD_WF60_BPHLCD60), BP_LCD_WF60_BPHLCD60, 1))
/*@}*/
/*******************************************************************************
 * HW_LCD_WF61 - LCD Waveform Register 61.
 ******************************************************************************/

/*!
 * @brief HW_LCD_WF61 - LCD Waveform Register 61. (RW)
 *
 * Reset value: 0x00U
 */
typedef union _hw_lcd_wf61
{
    uint8_t U;
    struct _hw_lcd_wf61_bitfields
    {
        uint8_t BPALCD61 : 1;          /*!< [0]  */
        uint8_t BPBLCD61 : 1;          /*!< [1]  */
        uint8_t BPCLCD61 : 1;          /*!< [2]  */
        uint8_t BPDLCD61 : 1;          /*!< [3]  */
        uint8_t BPELCD61 : 1;          /*!< [4]  */
        uint8_t BPFLCD61 : 1;          /*!< [5]  */
        uint8_t BPGLCD61 : 1;          /*!< [6]  */
        uint8_t BPHLCD61 : 1;          /*!< [7]  */
    } B;
} hw_lcd_wf61_t;

/*!
 * @name Constants and macros for entire LCD_WF61 register
 */
/*@{*/
#define HW_LCD_WF61_ADDR(x)      ((x) + 0x5DU)

#define HW_LCD_WF61(x)           (*(__IO hw_lcd_wf61_t *) HW_LCD_WF61_ADDR(x))
#define HW_LCD_WF61_RD(x)        (HW_LCD_WF61(x).U)
#define HW_LCD_WF61_WR(x, v)     (HW_LCD_WF61(x).U = (v))
#define HW_LCD_WF61_SET(x, v)    (BME_OR8(HW_LCD_WF61_ADDR(x), (uint8_t)(v)))
#define HW_LCD_WF61_CLR(x, v)    (BME_AND8(HW_LCD_WF61_ADDR(x), (uint8_t)(~(v))))
#define HW_LCD_WF61_TOG(x, v)    (BME_XOR8(HW_LCD_WF61_ADDR(x), (uint8_t)(v)))
/*@}*/

/*
 * Constants & macros for individual LCD_WF61 bitfields
 */

/*!
 * @name Register LCD_WF61, field BPALCD61[0] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase A
 * - 1 - LCD segment on or LCD backplane active for phase A
 */
/*@{*/
#define BP_LCD_WF61_BPALCD61 (0U)          /*!< Bit position for LCD_WF61_BPALCD61. */
#define BM_LCD_WF61_BPALCD61 (0x01U)       /*!< Bit mask for LCD_WF61_BPALCD61. */
#define BS_LCD_WF61_BPALCD61 (1U)          /*!< Bit field size in bits for LCD_WF61_BPALCD61. */

/*! @brief Read current value of the LCD_WF61_BPALCD61 field. */
#define BR_LCD_WF61_BPALCD61(x) (BME_UBFX8(HW_LCD_WF61_ADDR(x), BP_LCD_WF61_BPALCD61, BS_LCD_WF61_BPALCD61))

/*! @brief Format value for bitfield LCD_WF61_BPALCD61. */
#define BF_LCD_WF61_BPALCD61(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF61_BPALCD61) & BM_LCD_WF61_BPALCD61)

/*! @brief Set the BPALCD61 field to a new value. */
#define BW_LCD_WF61_BPALCD61(x, v) (BME_BFI8(HW_LCD_WF61_ADDR(x), ((uint8_t)(v) << BP_LCD_WF61_BPALCD61), BP_LCD_WF61_BPALCD61, 1))
/*@}*/

/*!
 * @name Register LCD_WF61, field BPBLCD61[1] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase B
 * - 1 - LCD segment on or LCD backplane active for phase B
 */
/*@{*/
#define BP_LCD_WF61_BPBLCD61 (1U)          /*!< Bit position for LCD_WF61_BPBLCD61. */
#define BM_LCD_WF61_BPBLCD61 (0x02U)       /*!< Bit mask for LCD_WF61_BPBLCD61. */
#define BS_LCD_WF61_BPBLCD61 (1U)          /*!< Bit field size in bits for LCD_WF61_BPBLCD61. */

/*! @brief Read current value of the LCD_WF61_BPBLCD61 field. */
#define BR_LCD_WF61_BPBLCD61(x) (BME_UBFX8(HW_LCD_WF61_ADDR(x), BP_LCD_WF61_BPBLCD61, BS_LCD_WF61_BPBLCD61))

/*! @brief Format value for bitfield LCD_WF61_BPBLCD61. */
#define BF_LCD_WF61_BPBLCD61(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF61_BPBLCD61) & BM_LCD_WF61_BPBLCD61)

/*! @brief Set the BPBLCD61 field to a new value. */
#define BW_LCD_WF61_BPBLCD61(x, v) (BME_BFI8(HW_LCD_WF61_ADDR(x), ((uint8_t)(v) << BP_LCD_WF61_BPBLCD61), BP_LCD_WF61_BPBLCD61, 1))
/*@}*/

/*!
 * @name Register LCD_WF61, field BPCLCD61[2] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase C
 * - 1 - LCD segment on or LCD backplane active for phase C
 */
/*@{*/
#define BP_LCD_WF61_BPCLCD61 (2U)          /*!< Bit position for LCD_WF61_BPCLCD61. */
#define BM_LCD_WF61_BPCLCD61 (0x04U)       /*!< Bit mask for LCD_WF61_BPCLCD61. */
#define BS_LCD_WF61_BPCLCD61 (1U)          /*!< Bit field size in bits for LCD_WF61_BPCLCD61. */

/*! @brief Read current value of the LCD_WF61_BPCLCD61 field. */
#define BR_LCD_WF61_BPCLCD61(x) (BME_UBFX8(HW_LCD_WF61_ADDR(x), BP_LCD_WF61_BPCLCD61, BS_LCD_WF61_BPCLCD61))

/*! @brief Format value for bitfield LCD_WF61_BPCLCD61. */
#define BF_LCD_WF61_BPCLCD61(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF61_BPCLCD61) & BM_LCD_WF61_BPCLCD61)

/*! @brief Set the BPCLCD61 field to a new value. */
#define BW_LCD_WF61_BPCLCD61(x, v) (BME_BFI8(HW_LCD_WF61_ADDR(x), ((uint8_t)(v) << BP_LCD_WF61_BPCLCD61), BP_LCD_WF61_BPCLCD61, 1))
/*@}*/

/*!
 * @name Register LCD_WF61, field BPDLCD61[3] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase D
 * - 1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
#define BP_LCD_WF61_BPDLCD61 (3U)          /*!< Bit position for LCD_WF61_BPDLCD61. */
#define BM_LCD_WF61_BPDLCD61 (0x08U)       /*!< Bit mask for LCD_WF61_BPDLCD61. */
#define BS_LCD_WF61_BPDLCD61 (1U)          /*!< Bit field size in bits for LCD_WF61_BPDLCD61. */

